yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
/****************************************************************************
 * board/contest_board/src/bk7258_camera.c
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * GC2145 Phase 1 - DVP IO + sensor init + PSRAM framebuf
 *
 * Phase 0: "camera id" - reads GC2145 chip ID via SCCB bit-bang
 * Phase 1: DVP data pin mux (P29-P39), GC2145 init, PSRAM buffer
 *
 * BK7258 GPIO CFG register (per-pin, at AON_GPIO_BASE + pin*4):
 *   bit[0]   gpio_input     (RO) - reads pin level
 *   bit[1]   gpio_output    (RW) - OUTPUT VALUE: 0=low, 1=high
 *   bit[2]   input_enable   (RW) - 1=enable input buffer
 *   bit[3]   output_enable  (RW, active-low) - 0=output enabled
 *   bit[4]   pull_mode      (RW) - 1=pull-up
 *   bit[5]   pull_enable    (RW) - 1=enable pull
 *   bit[6]   second_func    (RW) - 1=peripheral function, 0=GPIO
 *
 * Open-drain SCCB:
 *   Drive low  = output_enable=0, output_value=0, second_func=0
 *   Release    = output_enable=1(disabled), input_enable=1
 *
 * DVP data pins (P29-P39):
 *   Function select = 0 (JPEG_PCLK/HSYNC/VSYNC/PXDATA0-7)
 *   CFG: output_dis, input_dis, pull_dis, second_func=1
 *
 * GC2145 init table:
 *   Ported from ARMino dvp_gc2145.c (Apache-2.0, Galois Inc)
 *   Output format: reg 0x84 = 0x02, 640x480
 *   Actual PSRAM byte order: VYUY (V Y0 U Y1, color-target verified)
 *
 ****************************************************************************/

#include <nuttx/config.h>

#include <stdbool.h>
#include <stdint.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include <debug.h>
#include <unistd.h>
#include <fcntl.h>

#include <nuttx/arch.h>
#include <nuttx/clock.h>
#include <nuttx/irq.h>
#include <nuttx/spinlock.h>

#include "bk7258_gpio.h"
#include "bk7258_psram.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* CIS Controller (YUV_BUF) Register Base Address
 * From ARMino yuv_buf_reg.h: SOC_YUV_BUF_REG_BASE = 0x48020000
 * SOC_ADDR_OFFSET = 0 for non-secure world.
 */

#define YUV_BUF_REG_BASE          0x48020000u

/* Register offsets (word-addressed, multiply by 4 for byte offset) */

#define YUV_BUF_REG_0x04          (YUV_BUF_REG_BASE + 0x04 * 4)  /* CTRL */
#define YUV_BUF_REG_0x05          (YUV_BUF_REG_BASE + 0x05 * 4)  /* PIXEL */
#define YUV_BUF_REG_0x08          (YUV_BUF_REG_BASE + 0x08 * 4)  /* EM_BASE_ADDR */
#define YUV_BUF_REG_0x09          (YUV_BUF_REG_BASE + 0x09 * 4)  /* INT_EN */
#define YUV_BUF_REG_0x0a          (YUV_BUF_REG_BASE + 0x0a * 4)  /* INT_STATUS */

/* CTRL register (0x04) bit fields */

#define YUV_BUF_CTRL_YUV_MODE     (1u << 0)   /* bit[0]: 1=YUV buf mode */
#define YUV_BUF_CTRL_FMT_SEL_MASK 0x6u        /* bit[2:1]: YUV format */
#define YUV_BUF_CTRL_FMT_YUYV     (0u << 1)   /* 00=YUYV (HW label;
                                                  actual PSRAM byte order
                                                  with GC2145 is VYUY) */
#define YUV_BUF_CTRL_FMT_UYVY     (1u << 1)   /* 01=UYVY */
#define YUV_BUF_CTRL_FMT_YYUV     (2u << 1)   /* 10=YYUV */
#define YUV_BUF_CTRL_FMT_UVYY     (3u << 1)   /* 11=UVYY */
#define YUV_BUF_CTRL_H264_MODE    (1u << 3)   /* bit[3] */
#define YUV_BUF_CTRL_MCLK_HOLD    (1u << 4)   /* bit[4] */
#define YUV_BUF_CTRL_VCK_EDGE     (1u << 5)   /* bit[5]: PCLK edge */
#define YUV_BUF_CTRL_HSYNC_REV    (1u << 6)   /* bit[6]: invert HSYNC */
#define YUV_BUF_CTRL_VSYNC_REV    (1u << 7)   /* bit[7]: invert VSYNC */
#define YUV_BUF_CTRL_SOI_HSYNC    (1u << 8)   /* bit[8] */
#define YUV_BUF_CTRL_BPS_CIS      (1u << 9)   /* bit[9] */
#define YUV_BUF_CTRL_MEMREV       (1u << 10)  /* bit[10] */
#define YUV_BUF_CTRL_BYTE_REV     (1u << 11)  /* bit[11] */
#define YUV_BUF_CTRL_JPEG_WRD_REV (1u << 12)  /* bit[12] */
#define YUV_BUF_CTRL_PARTIAL_EN   (1u << 13)  /* bit[13] */
#define YUV_BUF_CTRL_SYNC_EDGE    (1u << 14)  /* bit[14] */
#define YUV_BUF_CTRL_MCLK_DIV_MASK 0x30000u   /* bit[17:16] */
#define YUV_BUF_CTRL_MCLK_DIV_POS  16

/* PIXEL register (0x05) bit fields */

#define YUV_BUF_PIXEL_X_MASK      0xFFu       /* bit[7:0]: x_pixel (width/8) */
#define YUV_BUF_PIXEL_Y_MASK      0xFF00u     /* bit[15:8]: y_pixel (height/8) */
#define YUV_BUF_PIXEL_Y_POS       8
#define YUV_BUF_PIXEL_BLK_MASK    0xFFFF0000u /* bit[31:16]: frame_blk */
#define YUV_BUF_PIXEL_BLK_POS     16

/* INT_EN register (0x09) bit fields */

#define YUV_BUF_INT_VSYNC_NEGE    (1u << 0)   /* VSYNC falling edge */
#define YUV_BUF_INT_YUV_ARV       (1u << 1)   /* YUV arrived (frame done) */
#define YUV_BUF_INT_SM0_WR        (1u << 2)   /* SM0 write */
#define YUV_BUF_INT_SM1_WR        (1u << 3)   /* SM1 write */
#define YUV_BUF_INT_FIFO_FULL     (1u << 4)   /* FIFO full */
#define YUV_BUF_INT_ENC_LINE_DONE (1u << 5)   /* encode line done */
#define YUV_BUF_INT_RES_ERR       (1u << 6)   /* resolution error */
#define YUV_BUF_INT_H264_ERR      (1u << 7)   /* H264 error */
#define YUV_BUF_INT_ENC_SLOW      (1u << 8)   /* encode slow */

/* INT_STATUS register (0x0a) - same bit layout as INT_EN */

#define YUV_BUF_INT_STATUS_MASK   0x1FFu      /* bits[8:0] */

