yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
/* DVP interrupt IRQ number
 * From ARMino int_types.h: INT_SRC_YUVB = 58 (for BK7258)
 * NuttX IRQ = BK7258_IRQ_EXTINT + 58 = 16 + 58 = 74
 */

#define BK7258_IRQ_YUV_BUF        (BK7258_IRQ_EXTINT + 58)

/* Module Clock Enable Register (sys_reserver_reg0xd)
 * Address: SOC_SYS_REG_BASE + 0xd * 4 = 0x44010000 + 0x34
 * Same register as CAMERA_CLK_EN_REG.
 *
 * bit[0]: h264_cken - H264 module clock (needed for YUV_BUF bus)
 * bit[3]: yuv_cken  - YUV_BUF module clock
 * bit[9]: cis_auxs_cken - CIS AUXS MCLK (already used for sensor)
 *
 * From ARMino sys_video_driver.c:yuv_buf_init_common()
 *   sys_drv_set_h264_clk_en(1);   - bit[0]
 *   sys_drv_set_yuv_buf_clk_en(1); - bit[3]
 */

#define CAMERA_H264_CLKEN_BIT     (1u << 0)
#define CAMERA_YUV_BUF_CLKEN_BIT  (1u << 3)

/* System Interrupt Enable Register (cpu1_int_32_63_en)
 * Address: SOC_SYS_REG_BASE + 0x23 * 4 = 0x44010000 + 0x8C
 *
 * bit[26]: cpu0_yuvb_int_en - YUV_BUF interrupt enable to CPU0
 *
 * From ARMino sys_types.h:
 *   YUV_BUF_INTERRUPT_CTRL_BIT = (1 << 26)
 */

#define CAMERA_SYS_INT_32_63_REG  (CAMERA_SYS_BASE + 0x8Cu)
#define CAMERA_YUVB_INT_EN_BIT    (1u << 26)

/* YUV_BUF Global Control Register (REG_0x02)
 * Address: YUV_BUF_REG_BASE + 0x02 * 4
 *
 * bit[0]: soft_reset - 0=assert, 1=deassert
 * bit[1]: clk_gate_bypass - 1=bypass clock gate
 *
 * From ARMino yuv_buf_ll.h:yuv_buf_ll_init()
 *   hw->global_ctrl.soft_reset = 0;   // assert reset
 *   hw->global_ctrl.soft_reset = 1;   // deassert reset
 *   hw->global_ctrl.clk_gate_bypass = 1; // bypass clock gate
 */

#define YUV_BUF_REG_0x02          (YUV_BUF_REG_BASE + 0x02 * 4)
#define YUV_BUF_GLOBAL_SOFT_RESET (1u << 0)
#define YUV_BUF_GLOBAL_CLK_GATE   (1u << 1)

#define CAMERA_GPIO_UNCONFIGURED  (-1)
#define CAMERA_GPIO_MIN           0

/* BK7258 QFN88 exposes GPIO0..GPIO55 (see datasheet Table 3-5 Pin
 * Multiplexing, which lists up to GPIO55).  DVP_PWR_CTL is P49 on this
 * board, so the valid range must not stop at 47.
 */

#define CAMERA_GPIO_MAX           55

/* Skin-tone detection thresholds (Cr/Cb domain).
 *
 * Calibration data (2026-08-21, 20 frames each, 4800 samples/frame,
 * zoom range [80,208]):
 *
 *                  Face      White wall   Wood photo
 *   Cr >= 154     29.2%      0.30%        5.95%
 *   Cr >= 158     18.6%      0.00%        1.29%   <- selected
 *   Cr >= 162     10.8%      0.00%        0.17%
 *
 * Cb has no discriminative power (face mean 93.3 / wall 89.7, nearly
 * identical distributions) and drifts 30-50 levels across sessions,
 * so it is used only as a loose gate.  Y < 50 renders chrominance
 * unreliable (occlusion test: 98% of samples collapse to neutral).
 */

#define SKIN_Y_LO    50    /* below this, chrominance is noise */
#define SKIN_Y_HI    230   /* above this, likely saturated */
#define SKIN_CB_LO   40    /* loose Cb gate (no discriminative power) */
#define SKIN_CB_HI   150
#define SKIN_CR_LO   152   /* skin vs wood-board separation, empirical
                            * (per-surface uvhist, zoom 96..176):
                            *   white wall  : Cr <= 138
                            *   wood board  : Cr mass <= 149, tail to ~154,
                            *                 but < 25 samples >= 152
                            *   frontal face: ~670 samples in Cr 152..165
                            * WB is low-saturation so skin and wood overlap
                            * below 150; they only separate in the skin
                            * tail.  152 + DETECT_MIN_HITS(96) keeps wood
                            * under the detection floor while a frontal
                            * face clears it ~7x.  (142 was wrong: wood
                            * has ~1376 samples >= 142.) */
#define SKIN_CR_HI   200
#define SKIN_CR_CEIL 166   /* face Cr tops ~164; orange wires >=175
                             * are non-skin red, clamp them here */

/* Adaptive skin threshold (demo scene has no wood, lighting is
 * uncontrolled).  The neutral background Cr peak is stable ~127
 * across all captures; skin is always the reddish tail above it.
 * Threshold = background_Cr_mode + margin, clamped.  This tracks
 * lighting/white-balance drift instead of using a fixed value.
 */
#define SKIN_CR_MARGIN  16   /* skin sits >= this above neutral peak */
#define SKIN_CR_LO_MIN  140  /* floor: neutral wall topped out at 138 */
#define SKIN_CR_LO_MAX  156  /* ceiling: skin tops ~167, cap prevents
                              * adaptive threshold from killing face */

/* Minimum hit count to report a direction.
 * Empty scenes test 0-29 hits; 60 rejects those while
 * recovering face frames in the 60-95 range that the
 * previous 96 threshold missed during motion.
 */

#define DETECT_MIN_HITS_PER_FRAME  60

/* Sampling grid: identical to uvhist */

#define DETECT_SAMPLES_X   80   /* every 4th VYUY group across 320 */
#define DETECT_SAMPLES_Y   60   /* every 8th row across 480 */
#define DETECT_TOTAL       (DETECT_SAMPLES_X * DETECT_SAMPLES_Y)

/* GC2145 chip ID */

#define GC2145_REG_ID_H    0xf0
#define GC2145_REG_ID_L    0xf1
#define GC2145_ID_H        0x21
#define GC2145_ID_L        0x45
#define GC2145_SCCB_ADDR   0x3c

/* BK7258 MCLK registers */

#define CAMERA_SYS_BASE           0x44010000u
#define CAMERA_CLK_DIV_REG        (CAMERA_SYS_BASE + 0x28u)
#define CAMERA_CKSEL_AUXS_CIS     3u
#define CAMERA_CKDIV_24MHZ        19u
#define CAMERA_CKSEL_POS          15u
#define CAMERA_CKSEL_MASK         0x3u
#define CAMERA_CKDIV_POS          17u
#define CAMERA_CKDIV_MASK         0x1fu
#define CAMERA_CLK_EN_REG         (CAMERA_SYS_BASE + 0x34u)
#define CAMERA_CIS_AUXS_CKEN_BIT  (1u << 9)
#define CAMERA_GPIO_FUNC_REG      (CAMERA_SYS_BASE + 0xCCu)
#define CAMERA_P27_FUNC_SHIFT     12u
#define CAMERA_P27_FUNC_MASK      0xFu
#define CAMERA_P27_FUNC_CIS_CLK   1u

#define CAMERA_MCLK_REQUIRED_PIN  27

/* SCCB timing */

#define SCCB_HALF_PERIOD_US  5
#define SCCB_TIMEOUT_ITER    1000

/* Reserved pins */

#define CAMERA_PIN_UART0_RX   10
#define CAMERA_PIN_UART0_TX   11
#define CAMERA_PIN_SWD_CLK    20
#define CAMERA_PIN_SWD_IO     21

/* DVP data pin range - P29 through P39 (11 pins)
 * P29=PCLK, P30=HSYNC, P31=VSYNC, P32-P39=PXDATA[0:7]
 * All use function select = 0 in their respective GPIO_FUNC registers.
 */

#define DVP_PIN_FIRST   29
#define DVP_PIN_LAST    39
#define DVP_PIN_COUNT   (DVP_PIN_LAST - DVP_PIN_FIRST + 1)

/* Frame buffer parameters - 640x480, 2 bytes/pixel (VYUY) */

