yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
#define CAMERA_HRES       640
#define CAMERA_VRES       480
#define CAMERA_BPP        2   /* 2 bytes per pixel (VYUY) */
#define CAMERA_FRAME_SIZE (CAMERA_HRES * CAMERA_VRES * CAMERA_BPP)
#define CAMERA_PSRAM_BASE 0x60000000u
#define CAMERA_BUF_COUNT  2

/****************************************************************************
 * Private Types
 ****************************************************************************/

typedef struct
{
  uint32_t cfg;
  uint32_t func;      /* saved 4-bit function field only */
  int      pin;       /* needed for read-modify-write restore */
  uintptr_t cfg_addr;
  uintptr_t func_addr;
} gpio_state_t;

typedef struct
{
  uint32_t clk_div;
  uint32_t clk_en;
  uint32_t func2431;   /* full P24-P31 function register value */
  uint32_t p27_cfg;    /* P27 GPIO CFG register value */
  bool     valid;
} mclk_state_t;

/****************************************************************************
 * Private Data
 ****************************************************************************/

static const int g_cam_sda_pin  = CONFIG_CAMERA_GPIO_SDA;
static const int g_cam_scl_pin  = CONFIG_CAMERA_GPIO_SCL;
static const int g_cam_rst_pin  = CONFIG_CAMERA_GPIO_RST;
static const int g_cam_pwr_pin  = CONFIG_CAMERA_GPIO_PWR_CTL;
static const int g_cam_pwdn_pin = CONFIG_CAMERA_GPIO_PWDNB;
static const int g_cam_mclk_pin = CONFIG_CAMERA_MCLK_GPIO;

/* DVP data pin state - saved before dvp_io_config(), restored by dvp_io_deconfig() */

static gpio_state_t g_dvp_state[DVP_PIN_COUNT];
static bool g_dvp_pins_configed = false;

/* Frame buffer pointers into PSRAM */

static volatile uint8_t *g_camera_buf[CAMERA_BUF_COUNT] = { NULL, NULL };
static bool g_framebuf_allocated = false;

/* Streaming state - ping-pong double buffering */

#define PREVIEW_W       160
#define PREVIEW_H       160
#define PREVIEW_SIZE    (PREVIEW_W * PREVIEW_H * 2)  /* 51200 bytes */
#define PREVIEW_ADDR    (CAMERA_PSRAM_BASE + 0x12C000u)  /* 0x6012C000 */

#define STREAM_BUF_MAX  1000

static volatile bool     g_stream_active   = false;
static volatile uint32_t g_pingpong_count  = 0;
static volatile uint32_t g_drop_count      = 0;
static volatile int      g_cur_buf         = 0;
static volatile int      g_ready_buf       = -1;
static volatile int      g_busy_buf        = -1;

/* LCD functions from bk7258_gc9d01.c (declared in board header) */

extern int  bk7258_lcd_preview_init(void);
extern void bk7258_lcd_preview_deinit(void);
extern void bk7258_lcd_blit_rgb565(int panel,
                                    uint16_t x0, uint16_t y0,
                                    uint16_t w, uint16_t h,
                                    const uint8_t *rgb565);
extern void bk7258_lcd_eye_draw(int panel, int gaze_dx);
extern void bk7258_lcd_eye_gaze(int panel,
                                 int old_dx, int new_dx);

/* DVP controller state - saved before dvp_ctrl_config(), restored by
 * dvp_ctrl_deconfig().  Only field-level RMW on shared registers.
 */

typedef struct
{
  uint32_t ctrl;        /* full CTRL register value (0x04) */
  uint32_t pixel;       /* full PIXEL register value (0x05) */
  uint32_t em_base;     /* EM_BASE_ADDR register value (0x08) */
  uint32_t int_en;      /* INT_EN register value (0x09) */
  uint32_t int_status;  /* INT_STATUS register value (0x0a) - write to clear */
  bool     valid;
} dvp_ctrl_state_t;

static dvp_ctrl_state_t g_dvp_ctrl_saved = { .valid = false };
static bool g_dvp_ctrl_configed = false;
static bool g_dvp_irq_attached = false;

/* DVP interrupt counters - incremented in ISR context */

static volatile uint32_t g_dvp_vsync_count = 0;
static volatile uint32_t g_dvp_hsync_count = 0;  /* not used yet, reserved */
static volatile uint32_t g_dvp_frame_count = 0;

/****************************************************************************
 * GC2145 Init Table (640x480)
 *
 * Ported from ARMino dvp_gc2145.c (Apache-2.0, Galois Inc).
 * Output format: register 0x84 = 0x02 (ARMino calls this "yuyv").
 * Actual PSRAM byte order: VYUY (V Y0 U Y1, color-target verified).
 * Frame rate section (#if 0) excluded; drive strength included.
 ****************************************************************************/

static const uint8_t gc2145_init[][2] =
{
  {0xfe, 0xf0},
  {0xfe, 0xf0},
  {0xfe, 0xf0},
  {0xfc, 0x06},
  {0xf6, 0x00},
  {0xf7, 0x1d},
  {0xf8, 0x84},
  {0xfa, 0x00},
  {0xf9, 0xfe},
  {0xf2, 0x00},
  {0xfe, 0x00},
  {0x03, 0x04},
  {0x04, 0xe2},
  {0x09, 0x00},
  {0x0a, 0x00},
  {0x0b, 0x00},
  {0x0c, 0x00},
  {0x0d, 0x04},
  {0x0e, 0xc0},
  {0x0f, 0x06},
  {0x10, 0x52},
  {0x12, 0x2e},
  {0x17, 0x14},
  {0x18, 0x22},
  {0x19, 0x0e},
  {0x1a, 0x01},
  {0x1b, 0x4b},
  {0x1c, 0x07},
  {0x1d, 0x10},
  {0x1e, 0x88},
  {0x1f, 0x78},
  {0x20, 0x03},
  {0x21, 0x40},
  {0x22, 0xa0},
  {0x24, 0x16},
  {0x25, 0x01},
  {0x26, 0x10},
  {0x2d, 0x60},
  {0x30, 0x01},
  {0x31, 0x90},
  {0x33, 0x06},
  {0x34, 0x01},
  {0xfe, 0x00},
  {0x80, 0x7f},
  {0x81, 0x26},
  {0x82, 0xfa},
  {0x83, 0x00},
  {0x84, 0x02},  /* output format (PSRAM byte order = VYUY) */
  {0x86, 0x03},
  {0x88, 0x03},
  {0x89, 0x03},
  {0x85, 0x08},
  {0x8a, 0x00},
  {0x8b, 0x00},
  {0xb0, 0x55},
  {0xc3, 0x00},
  {0xc4, 0x80},
  {0xc5, 0x90},
  {0xc6, 0x3b},
  {0xc7, 0x46},
  {0xec, 0x06},
  {0xed, 0x04},
  {0xee, 0x60},
  {0xef, 0x90},
  {0xb6, 0x01},
  {0x90, 0x01},
  {0x91, 0x00},
  {0x92, 0x00},
  {0x93, 0x00},
  {0x94, 0x00},
  {0x95, 0x04},
  {0x96, 0xb0},
  {0x97, 0x06},
  {0x98, 0x40},
  {0xfe, 0x00},
  {0x40, 0x42},
  {0x41, 0x00},
  {0x43, 0x5b},
  {0x5e, 0x00},
  {0x5f, 0x00},
  {0x60, 0x00},
  {0x61, 0x00},
  {0x62, 0x00},
  {0x63, 0x00},
  {0x64, 0x00},
  {0x65, 0x00},
  {0x66, 0x20},
  {0x67, 0x20},
  {0x68, 0x20},
  {0x69, 0x20},
  {0x76, 0x00},
  {0x6a, 0x08},
  {0x6b, 0x08},
  {0x6c, 0x08},
  {0x6d, 0x08},
  {0x6e, 0x08},
  {0x6f, 0x08},
  {0x70, 0x08},
  {0x71, 0x08},
  {0x76, 0x00},
  {0x72, 0xf0},
  {0x7e, 0x3c},
  {0x7f, 0x00},
  {0xfe, 0x02},
  {0x48, 0x15},
  {0x49, 0x00},
  {0x4b, 0x0b},
  {0xfe, 0x00},
  {0xfe, 0x01},
  {0x01, 0x04},
  {0x02, 0xc0},
  {0x03, 0x04},
  {0x04, 0x90},
  {0x05, 0x30},
  {0x06, 0x90},
  {0x07, 0x30},
  {0x08, 0x80},
  {0x09, 0x00},
  {0x0a, 0x82},
  {0x0b, 0x11},
  {0x0c, 0x10},
  {0x11, 0x10},
  {0x13, 0x7b},
  {0x17, 0x00},
  {0x1c, 0x11},
  {0x1e, 0x61},
  {0x1f, 0x35},
  {0x20, 0x40},
  {0x22, 0x40},
  {0x23, 0x20},
  {0xfe, 0x02},
  {0x0f, 0x04},
  {0xfe, 0x01},
  {0x12, 0x35},
  {0x15, 0xb0},
  {0x10, 0x31},
  {0x3e, 0x28},
  {0x3f, 0xb0},
  {0x40, 0x90},
  {0x41, 0x0f},
  {0xfe, 0x02},
  {0x90, 0x6c},
  {0x91, 0x03},
  {0x92, 0xcb},
  {0x94, 0x33},
  {0x95, 0x84},
  {0x97, 0x65},
  {0xa2, 0x11},
  {0xfe, 0x00},
  {0xfe, 0x02},
  {0x80, 0xc1},
  {0x81, 0x08},
  {0x82, 0x05},
  {0x83, 0x08},
  {0x84, 0x0a},
  {0x86, 0xf0},
  {0x87, 0x50},
  {0x88, 0x15},
  {0x89, 0xb0},
  {0x8a, 0x30},
  {0x8b, 0x10},
  {0xfe, 0x01},
  {0x21, 0x04},
  {0xfe, 0x02},
  {0xa3, 0x50},
  {0xa4, 0x20},
  {0xa5, 0x40},
  {0xa6, 0x80},
  {0xab, 0x40},
  {0xae, 0x0c},
  {0xb3, 0x46},
  {0xb4, 0x64},
  {0xb6, 0x38},
  {0xb7, 0x01},
  {0xb9, 0x2b},
  {0x3c, 0x04},
  {0x3d, 0x15},
  {0x4b, 0x06},
  {0x4c, 0x20},
  {0xfe, 0x00},
  {0xfe, 0x02},
  {0x10, 0x09},
  {0x11, 0x0d},
  {0x12, 0x13},
  {0x13, 0x19},
  {0x14, 0x27},
  {0x15, 0x37},
  {0x16, 0x45},
  {0x17, 0x53},
  {0x18, 0x69},
  {0x19, 0x7d},
  {0x1a, 0x8f},
  {0x1b, 0x9d},
  {0x1c, 0xa9},
  {0x1d, 0xbd},
  {0x1e, 0xcd},
  {0x1f, 0xd9},
  {0x20, 0xe3},
  {0x21, 0xea},
  {0x22, 0xef},
  {0x23, 0xf5},
  {0x24, 0xf9},
  {0x25, 0xff},
  {0xfe, 0x00},
  {0xc6, 0x20},
  {0xc7, 0x2b},
  {0xfe, 0x02},
  {0x26, 0x0f},
  {0x27, 0x14},
  {0x28, 0x19},
  {0x29, 0x1e},
  {0x2a, 0x27},
  {0x2b, 0x33},
  {0x2c, 0x3b},
  {0x2d, 0x45},
  {0x2e, 0x59},
  {0x2f, 0x69},
  {0x30, 0x7c},
  {0x31, 0x89},
  {0x32, 0x98},
  {0x33, 0xae},
  {0x34, 0xc0},
  {0x35, 0xcf},
  {0x36, 0xda},
  {0x37, 0xe2},
  {0x38, 0xe9},
  {0x39, 0xf3},
  {0x3a, 0xf9},
  {0x3b, 0xff},
  {0xfe, 0x02},
  {0xd1, 0x32},
  {0xd2, 0x32},
  {0xd3, 0x40},
  {0xd6, 0xf0},
  {0xd7, 0x10},
  {0xd8, 0xda},
  {0xdd, 0x14},
  {0xde, 0x86},
  {0xed, 0x80},
  {0xee, 0x00},
  {0xef, 0x3f},
  {0xd8, 0xd8},
  {0xfe, 0x01},
  {0x9f, 0x40},
  {0xfe, 0x01},
  {0xc2, 0x14},
  {0xc3, 0x0d},
  {0xc4, 0x0c},
  {0xc8, 0x15},
  {0xc9, 0x0d},
  {0xca, 0x0a},
  {0xbc, 0x24},
  {0xbd, 0x10},
  {0xbe, 0x0b},
  {0xb6, 0x25},
  {0xb7, 0x16},
  {0xb8, 0x15},
  {0xc5, 0x00},
  {0xc6, 0x00},
  {0xc7, 0x00},
  {0xcb, 0x00},
  {0xcc, 0x00},
  {0xcd, 0x00},
  {0xbf, 0x07},
  {0xc0, 0x00},
  {0xc1, 0x00},
  {0xb9, 0x00},
  {0xba, 0x00},
  {0xbb, 0x00},
  {0xaa, 0x01},
  {0xab, 0x01},
  {0xac, 0x00},
  {0xad, 0x05},
  {0xae, 0x06},
  {0xaf, 0x0e},
  {0xb0, 0x0b},
  {0xb1, 0x07},
  {0xb2, 0x06},
  {0xb3, 0x17},
  {0xb4, 0x0e},
  {0xb5, 0x0e},
  {0xd0, 0x09},
  {0xd1, 0x00},
  {0xd2, 0x00},
  {0xd6, 0x08},
  {0xd7, 0x00},
  {0xd8, 0x00},
  {0xd9, 0x00},
  {0xda, 0x00},
  {0xdb, 0x00},
  {0xd3, 0x0a},
  {0xd4, 0x00},
  {0xd5, 0x00},
  {0xa4, 0x00},
  {0xa5, 0x00},
  {0xa6, 0x77},
  {0xa7, 0x77},
  {0xa8, 0x77},
  {0xa9, 0x77},
  {0xa1, 0x80},
  {0xa2, 0x80},
  {0xfe, 0x01},
  {0xdf, 0x0d},
  {0xdc, 0x25},
  {0xdd, 0x30},
  {0xe0, 0x77},
  {0xe1, 0x80},
  {0xe2, 0x77},
  {0xe3, 0x90},
  {0xe6, 0x90},
  {0xe7, 0xa0},
  {0xe8, 0x90},
  {0xe9, 0xa0},
  {0xfe, 0x00},
  {0xfe, 0x01},
  {0x4f, 0x00},
  {0x4f, 0x00},
  {0x4b, 0x01},
  {0x4f, 0x00},
  {0x4c, 0x01},
  {0x4d, 0x71},
  {0x4e, 0x01},
  {0x4c, 0x01},
  {0x4d, 0x91},
  {0x4e, 0x01},
  {0x4c, 0x01},
  {0x4d, 0x70},
  {0x4e, 0x01},
  {0x4c, 0x01},
  {0x4d, 0x90},
  {0x4e, 0x02},
  {0x4c, 0x01},
  {0x4d, 0xb0},
  {0x4e, 0x02},
  {0x4c, 0x01},
  {0x4d, 0x8f},
  {0x4e, 0x02},
  {0x4c, 0x01},
  {0x4d, 0x6f},
  {0x4e, 0x02},
  {0x4c, 0x01},
  {0x4d, 0xaf},
  {0x4e, 0x02},
  {0x4c, 0x01},
  {0x4d, 0xd0},
  {0x4e, 0x02},
  {0x4c, 0x01},
  {0x4d, 0xf0},
  {0x4e, 0x02},
  {0x4c, 0x01},
  {0x4d, 0xcf},
  {0x4e, 0x02},
  {0x4c, 0x01},
  {0x4d, 0xef},
  {0x4e, 0x02},
  {0x4c, 0x01},
  {0x4d, 0x6e},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0x8e},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0xae},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0xce},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0x4d},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0x6d},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0x8d},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0xad},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0xcd},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0x4c},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0x6c},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0x8c},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0xac},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0xcc},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0xcb},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0x4b},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0x6b},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0x8b},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0xab},
  {0x4e, 0x03},
  {0x4c, 0x01},
  {0x4d, 0x8a},
  {0x4e, 0x04},
  {0x4c, 0x01},
  {0x4d, 0xaa},
  {0x4e, 0x04},
  {0x4c, 0x01},
  {0x4d, 0xca},
  {0x4e, 0x04},
  {0x4c, 0x01},
  {0x4d, 0xca},
  {0x4e, 0x04},
  {0x4c, 0x01},
  {0x4d, 0xc9},
  {0x4e, 0x04},
  {0x4c, 0x01},
  {0x4d, 0x8a},
  {0x4e, 0x04},
  {0x4c, 0x01},
  {0x4d, 0x89},
  {0x4e, 0x04},
  {0x4c, 0x01},
  {0x4d, 0xa9},
  {0x4e, 0x04},
  {0x4c, 0x02},
  {0x4d, 0x0b},
  {0x4e, 0x05},
  {0x4c, 0x02},
  {0x4d, 0x0a},
  {0x4e, 0x05},
  {0x4c, 0x01},
  {0x4d, 0xeb},
  {0x4e, 0x05},
  {0x4c, 0x01},
  {0x4d, 0xea},
  {0x4e, 0x05},
  {0x4c, 0x02},
  {0x4d, 0x09},
  {0x4e, 0x05},
  {0x4c, 0x02},
  {0x4d, 0x29},
  {0x4e, 0x05},
  {0x4c, 0x02},
  {0x4d, 0x2a},
  {0x4e, 0x05},
  {0x4c, 0x02},
  {0x4d, 0x4a},
  {0x4e, 0x05},
  {0x4c, 0x02},
  {0x4d, 0x8a},
  {0x4e, 0x06},
  {0x4c, 0x02},
  {0x4d, 0x49},
  {0x4e, 0x06},
  {0x4c, 0x02},
  {0x4d, 0x69},
  {0x4e, 0x06},
  {0x4c, 0x02},
  {0x4d, 0x89},
  {0x4e, 0x06},
  {0x4c, 0x02},
  {0x4d, 0xa9},
  {0x4e, 0x06},
  {0x4c, 0x02},
  {0x4d, 0x48},
  {0x4e, 0x06},
  {0x4c, 0x02},
  {0x4d, 0x68},
  {0x4e, 0x06},
  {0x4c, 0x02},
  {0x4d, 0x69},
  {0x4e, 0x06},
  {0x4c, 0x02},
  {0x4d, 0xca},
  {0x4e, 0x07},
  {0x4c, 0x02},
  {0x4d, 0xc9},
  {0x4e, 0x07},
  {0x4c, 0x02},
  {0x4d, 0xe9},
  {0x4e, 0x07},
  {0x4c, 0x03},
  {0x4d, 0x09},
  {0x4e, 0x07},
  {0x4c, 0x02},
  {0x4d, 0xc8},
  {0x4e, 0x07},
  {0x4c, 0x02},
  {0x4d, 0xe8},
  {0x4e, 0x07},
  {0x4c, 0x02},
  {0x4d, 0xa7},
  {0x4e, 0x07},
  {0x4c, 0x02},
  {0x4d, 0xc7},
  {0x4e, 0x07},
  {0x4c, 0x02},
  {0x4d, 0xe7},
  {0x4e, 0x07},
  {0x4c, 0x03},
  {0x4d, 0x07},
  {0x4e, 0x07},
  {0x4f, 0x01},
  {0x50, 0x80},
  {0x51, 0xa8},
  {0x52, 0x47},
  {0x53, 0x38},
  {0x54, 0xc7},
  {0x56, 0x0e},
  {0x58, 0x08},
  {0x5b, 0x00},
  {0x5c, 0x74},
  {0x5d, 0x8b},
  {0x61, 0xdb},
  {0x62, 0xb8},
  {0x63, 0x86},
  {0x64, 0xc0},
  {0x65, 0x04},
  {0x67, 0xa8},
  {0x68, 0xb0},
  {0x69, 0x00},
  {0x6a, 0xa8},
  {0x6b, 0xb0},
  {0x6c, 0xaf},
  {0x6d, 0x8b},
  {0x6e, 0x50},
  {0x6f, 0x18},
  {0x73, 0xf0},
  {0x70, 0x0d},
  {0x71, 0x60},
  {0x72, 0x80},
  {0x74, 0x01},
  {0x75, 0x01},
  {0x7f, 0x0c},
  {0x76, 0x70},
  {0x77, 0x58},
  {0x78, 0xa0},
  {0x79, 0x5e},
  {0x7a, 0x54},
  {0x7b, 0x58},
  {0xfe, 0x00},
  {0xfe, 0x02},
  {0xc0, 0x01},
  {0xc1, 0x44},
  {0xc2, 0xfd},
  {0xc3, 0x04},
  {0xc4, 0xF0},
  {0xc5, 0x48},
  {0xc6, 0xfd},
  {0xc7, 0x46},
  {0xc8, 0xfd},
  {0xc9, 0x02},
  {0xca, 0xe0},
  {0xcb, 0x45},
  {0xcc, 0xec},
  {0xcd, 0x48},
  {0xce, 0xf0},
  {0xcf, 0xf0},
  {0xe3, 0x0c},
  {0xe4, 0x4b},
  {0xe5, 0xe0},
  {0xfe, 0x01},
  {0x9f, 0x40},
  {0xfe, 0x00},
  {0xfe, 0x00},
  {0xf2, 0x0f},
  {0xfe, 0x02},
  {0x40, 0xbf},
  {0x46, 0xcf},
  {0xfe, 0x00},
  {0xfe, 0x00},
  {0x24, 0xff},
  {0xfe, 0x00},
};

/****************************************************************************
 * GC2145 640x480 Resolution Table
 *
 * Sets crop window, output window, and clock divider for 640x480 output.
 ****************************************************************************/

static const uint8_t gc2145_640x480[][2] =
{
  {0xfe, 0x00},
  {0x05, 0x01},
  {0x06, 0x56},
  {0x07, 0x00},
  {0x08, 0x32},
  {0xfe, 0x01},
  {0x25, 0x00},
  {0x26, 0xfa},
  {0x27, 0x04},
  {0x28, 0xe2},
  {0x29, 0x04},
  {0x2a, 0xe2},
  {0x2b, 0x04},
  {0x2c, 0xe2},
  {0x2d, 0x04},
  {0x2e, 0xe2},
  {0xfe, 0x00},
  {0xfe, 0x00},
  {0xfe, 0x00},
  {0xf8, 0x85},
  {0xfa, 0x00},
  {0xfe, 0x00},
  {0x09, 0x00},
  {0x0a, 0x78},
  {0x0b, 0x00},
  {0x0c, 0xA0},
  {0x0d, 0x03},
  {0x0e, 0xd0},
  {0x0f, 0x05},
  {0x10, 0x10},
  {0xfd, 0x01},
  {0x90, 0x01},
  {0x91, 0x00},
  {0x92, 0x00},
  {0x93, 0x00},
  {0x94, 0x00},
  {0x95, 0x01},
  {0x96, 0xe0},
  {0x97, 0x02},
  {0x98, 0x80},
};

/****************************************************************************
 * GPIO Helpers
 *
 * register: CFG = AON_GPIO_BASE + pin*4
 *   bit[1] = output value (0=low, 1=high)
 *   bit[3] = output enable (active-low: 0=enabled)
 *   bit[2] = input enable
 *   bit[6] = second function
 ****************************************************************************/

static inline bool gpio_is_valid(int pin)
{
  return pin >= CAMERA_GPIO_MIN && pin <= CAMERA_GPIO_MAX;
}

static void gpio_save_state(int pin, gpio_state_t *s)
{
  int shift;
  uint32_t func_raw;

