yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
  s->pin       = pin;
  s->cfg_addr  = BK7258_GPIO_CFG(pin);
  s->func_addr = BK7258_SYS_GPIO_FUNC(pin);
  s->cfg       = getreg32(s->cfg_addr);

  /* Save only this pin's 4-bit function field */

  func_raw = getreg32(s->func_addr);
  shift    = (pin & 7) * 4;
  s->func  = (func_raw >> shift) & 0xFu;
}

static void gpio_restore_state(const gpio_state_t *s)
{
  int shift;
  uint32_t func_val;

  putreg32(s->cfg, s->cfg_addr);

  /* Read-modify-write: only restore this pin's 4-bit function field */

  shift    = (s->pin & 7) * 4;
  func_val = getreg32(s->func_addr);
  func_val &= ~(0xFu << shift);
  func_val |= (s->func & 0xFu) << shift;
  putreg32(func_val, s->func_addr);
}

/****************************************************************************
 * Name: gpio_drive_low
 *   Output value=0, output enabled, GPIO mode.
 ****************************************************************************/

static void gpio_drive_low(int pin)
{
  uintptr_t addr = BK7258_GPIO_CFG(pin);
  uint32_t cfg = getreg32(addr);

  cfg &= ~GPIO_CFG_SECOND_FUNC;  /* bit6=0: GPIO mode */
  cfg &= ~GPIO_CFG_OUTPUT;       /* bit1=0: output value = LOW */
  cfg &= ~GPIO_CFG_OUTPUT_EN;    /* bit3=0: output enabled (active-low) */

  putreg32(cfg, addr);
}

/****************************************************************************
 * Name: gpio_set_output_high
 *   Output value=1, output enabled, GPIO mode.
 ****************************************************************************/

static void gpio_set_output_high(int pin)
{
  uintptr_t addr = BK7258_GPIO_CFG(pin);
  uint32_t cfg = getreg32(addr);

  cfg &= ~GPIO_CFG_SECOND_FUNC;  /* bit6=0: GPIO mode */
  cfg |=  GPIO_CFG_OUTPUT;       /* bit1=1: output value = HIGH */
  cfg &= ~GPIO_CFG_OUTPUT_EN;    /* bit3=0: output enabled (active-low) */

  putreg32(cfg, addr);
}

/****************************************************************************
 * Name: gpio_release
 *   Output disabled, input enabled, GPIO mode (high-Z).
 ****************************************************************************/

static void gpio_release(int pin)
{
  uintptr_t addr = BK7258_GPIO_CFG(pin);
  uint32_t cfg = getreg32(addr);

  cfg &= ~GPIO_CFG_SECOND_FUNC;  /* bit6=0: GPIO mode */
  cfg &= ~GPIO_CFG_OUTPUT;       /* bit1=0: value=0 (irrelevant when out dis) */
  cfg |=  GPIO_CFG_OUTPUT_EN;    /* bit3=1: output DISABLED (active-low) */
  cfg |=  GPIO_CFG_INPUT_EN;     /* bit2=1: input enabled */

  putreg32(cfg, addr);
}

static bool gpio_read_input(int pin)
{
  return (getreg32(BK7258_GPIO_CFG(pin)) & GPIO_CFG_INPUT) != 0;
}

/****************************************************************************
 * SCCB Bit-Bang
 ****************************************************************************/

static void sccb_sda_low(void)     { gpio_drive_low(g_cam_sda_pin); }
static void sccb_sda_release(void) { gpio_release(g_cam_sda_pin); }
static void sccb_scl_low(void)     { gpio_drive_low(g_cam_scl_pin); }
static void sccb_scl_release(void) { gpio_release(g_cam_scl_pin); }
static bool sccb_sda_read(void)    { return gpio_read_input(g_cam_sda_pin); }

static int sccb_scl_wait_high(void)
{
  int timeout = SCCB_TIMEOUT_ITER;
  while (timeout-- > 0)
    {
      if (gpio_read_input(g_cam_scl_pin)) return 0;
      up_udelay(SCCB_HALF_PERIOD_US);
    }
  syslog(LOG_ERR, "[camera] SCL stuck low\n");
  return -ETIMEDOUT;
}

static int sccb_start(void)
{
  int ret;

  sccb_sda_release();
  sccb_scl_release();
  up_udelay(SCCB_HALF_PERIOD_US);

  /* Bus-free check */

  if (!gpio_read_input(g_cam_scl_pin))
    {
      ret = sccb_scl_wait_high();
      if (ret < 0) return ret;
    }

  if (!gpio_read_input(g_cam_sda_pin))
    {
      /* SDA stuck low - 9-clock recovery */

      int i;
      for (i = 0; i < 9; i++)
        {
          sccb_scl_low();
          up_udelay(SCCB_HALF_PERIOD_US);
          sccb_scl_release();
          ret = sccb_scl_wait_high();
          if (ret < 0) return ret;
          up_udelay(SCCB_HALF_PERIOD_US);
          if (gpio_read_input(g_cam_sda_pin)) break;
        }
      if (!gpio_read_input(g_cam_sda_pin))
        {
          syslog(LOG_ERR, "[camera] SDA stuck low - recovery failed\n");
          return -EIO;
        }
    }

  /* START: SDA falls while SCL high */

  sccb_sda_low();
  up_udelay(SCCB_HALF_PERIOD_US);
  sccb_scl_low();
  up_udelay(SCCB_HALF_PERIOD_US);

  return 0;
}

static int sccb_stop(void)
{
  int ret;

  sccb_sda_low();
  up_udelay(SCCB_HALF_PERIOD_US);

  sccb_scl_release();
  ret = sccb_scl_wait_high();
  if (ret < 0) return ret;

  up_udelay(SCCB_HALF_PERIOD_US);

  sccb_sda_release();
  up_udelay(SCCB_HALF_PERIOD_US);

  return 0;
}

static int sccb_write_byte(uint8_t byte)
{
  int i, ret;
  bool ack;

  for (i = 7; i >= 0; i--)
    {
      if ((byte >> i) & 1) sccb_sda_release();
      else                 sccb_sda_low();

      up_udelay(SCCB_HALF_PERIOD_US);

      sccb_scl_release();
      ret = sccb_scl_wait_high();
      if (ret < 0) return ret;
      up_udelay(SCCB_HALF_PERIOD_US);

      sccb_scl_low();
      up_udelay(SCCB_HALF_PERIOD_US);
    }

  /* ACK clock */

  sccb_sda_release();
  up_udelay(SCCB_HALF_PERIOD_US);

  sccb_scl_release();
  ret = sccb_scl_wait_high();
  if (ret < 0) return ret;
  up_udelay(SCCB_HALF_PERIOD_US);

  ack = !sccb_sda_read();

  sccb_scl_low();
  up_udelay(SCCB_HALF_PERIOD_US);

  return ack ? 0 : -EIO;
}

static int sccb_read_byte(bool ack)
{
  uint8_t byte = 0;
  int i, ret;

  sccb_sda_release();

  for (i = 7; i >= 0; i--)
    {
      up_udelay(SCCB_HALF_PERIOD_US);
      sccb_scl_release();
      ret = sccb_scl_wait_high();
      if (ret < 0) return ret;
      up_udelay(SCCB_HALF_PERIOD_US);

      if (sccb_sda_read()) byte |= (1u << i);

      sccb_scl_low();
      up_udelay(SCCB_HALF_PERIOD_US);
    }

  if (ack) sccb_sda_low();
  else     sccb_sda_release();

  up_udelay(SCCB_HALF_PERIOD_US);

  sccb_scl_release();
  ret = sccb_scl_wait_high();
  if (ret < 0) return ret;
  up_udelay(SCCB_HALF_PERIOD_US);

  sccb_scl_low();
  up_udelay(SCCB_HALF_PERIOD_US);
  sccb_sda_release();

