yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
  return (int)byte;
}

static int sccb_read_reg(uint8_t reg_addr)
{
  int ret, value, stop_ret;

  /* Phase 1: write address */

  ret = sccb_start();
  if (ret < 0) return ret;

  ret = sccb_write_byte((uint8_t)(GC2145_SCCB_ADDR << 1) | 0);
  if (ret < 0) goto stop_fail;

  ret = sccb_write_byte(reg_addr);
  if (ret < 0) goto stop_fail;

  stop_ret = sccb_stop();
  if (stop_ret < 0) return stop_ret;

  /* Phase 2: read value */

  ret = sccb_start();
  if (ret < 0) return ret;

  ret = sccb_write_byte((uint8_t)(GC2145_SCCB_ADDR << 1) | 1);
  if (ret < 0) goto stop_fail;

  value = sccb_read_byte(false);
  if (value < 0) { ret = value; goto stop_fail; }

  stop_ret = sccb_stop();
  if (stop_ret < 0) return stop_ret;

  return value;

stop_fail:
  stop_ret = sccb_stop();
  return (stop_ret < 0) ? stop_ret : ret;
}

/****************************************************************************
 * Name: sccb_write_reg
 *   Write a single 8-bit value to a GC2145 register via SCCB.
 *   Same error handling quality as sccb_read_reg().
 ****************************************************************************/

static int sccb_write_reg(uint8_t reg_addr, uint8_t val)
{
  int ret, stop_ret;

  ret = sccb_start();
  if (ret < 0) return ret;

  ret = sccb_write_byte((uint8_t)(GC2145_SCCB_ADDR << 1) | 0);
  if (ret < 0) goto stop_fail;

  ret = sccb_write_byte(reg_addr);
  if (ret < 0) goto stop_fail;

  ret = sccb_write_byte(val);
  if (ret < 0) goto stop_fail;

  stop_ret = sccb_stop();
  if (stop_ret < 0) return stop_ret;

  return 0;

stop_fail:
  stop_ret = sccb_stop();
  return (stop_ret < 0) ? stop_ret : ret;
}

/****************************************************************************
 * MCLK
 *
 * mclk_enable_24mhz modifies 4 registers:
 *   1. GPIO FUNC (shared P24-P31) - only P27 bits
 *   2. P27 GPIO CFG - set second_func=1 (bit6)
 *   3. CLK DIV - cksel + ckdiv
 *   4. CLK EN - enable gate
 *
 * Restore uses read-modify-write on shared registers.
 ****************************************************************************/

static void mclk_save_state(mclk_state_t *ms)
{
  uint32_t val;

  /* Save only the MCLK-relevant bit fields from shared registers */

  val = getreg32(CAMERA_CLK_DIV_REG);
  ms->clk_div = val & ((CAMERA_CKSEL_MASK << CAMERA_CKSEL_POS) |
                        (CAMERA_CKDIV_MASK << CAMERA_CKDIV_POS));

  val = getreg32(CAMERA_CLK_EN_REG);
  ms->clk_en = val & CAMERA_CIS_AUXS_CKEN_BIT;

  val = getreg32(CAMERA_GPIO_FUNC_REG);
  ms->func2431 = val & (CAMERA_P27_FUNC_MASK << CAMERA_P27_FUNC_SHIFT);

  ms->p27_cfg = getreg32(BK7258_GPIO_CFG(CAMERA_MCLK_REQUIRED_PIN));
  ms->valid   = true;
}

static void mclk_restore_state(const mclk_state_t *ms)
{
  uint32_t val;

  if (!ms->valid) return;

  /* 1. Gate OFF first - avoid glitch while source/divider changes */

  val = getreg32(CAMERA_CLK_EN_REG);
  val &= ~CAMERA_CIS_AUXS_CKEN_BIT;
  putreg32(val, CAMERA_CLK_EN_REG);

  /* 2. Restore cksel/ckdiv - read-modify-write, safe while gate off */

  val = getreg32(CAMERA_CLK_DIV_REG);
  val &= ~((CAMERA_CKSEL_MASK << CAMERA_CKSEL_POS) |
            (CAMERA_CKDIV_MASK << CAMERA_CKDIV_POS));
  val |= ms->clk_div;
  putreg32(val, CAMERA_CLK_DIV_REG);

  /* 3. Restore P27 function select - read-modify-write FUNC reg */

  val = getreg32(CAMERA_GPIO_FUNC_REG);
  val &= ~(CAMERA_P27_FUNC_MASK << CAMERA_P27_FUNC_SHIFT);
  val |= ms->func2431;
  putreg32(val, CAMERA_GPIO_FUNC_REG);

  /* 4. Restore P27 GPIO CFG (direction/latch/pull) - per-pin, safe */

  putreg32(ms->p27_cfg, BK7258_GPIO_CFG(CAMERA_MCLK_REQUIRED_PIN));

  /* 5. Restore saved gate state - read-modify-write CLK_EN */

  val = getreg32(CAMERA_CLK_EN_REG);
  val &= ~CAMERA_CIS_AUXS_CKEN_BIT;
  val |= ms->clk_en;
  putreg32(val, CAMERA_CLK_EN_REG);
}

static void mclk_enable_24mhz(void)
{
  uint32_t val;

  /* 1. Gate OFF - avoid glitch while source/divider changes */

  val = getreg32(CAMERA_CLK_EN_REG);
  val &= ~CAMERA_CIS_AUXS_CKEN_BIT;
  putreg32(val, CAMERA_CLK_EN_REG);

  /* 2. Unmap P27 - clear function select (ARMino: gpio_dev_unmap) */

  val = getreg32(CAMERA_GPIO_FUNC_REG);
  val &= ~(CAMERA_P27_FUNC_MASK << CAMERA_P27_FUNC_SHIFT);
  putreg32(val, CAMERA_GPIO_FUNC_REG);

  /* 3. Remap P27 -> CIS AUXS clock (ARMino: gpio_dev_map) */

  val = getreg32(CAMERA_GPIO_FUNC_REG);
  val |= (CAMERA_P27_FUNC_CIS_CLK << CAMERA_P27_FUNC_SHIFT);
  putreg32(val, CAMERA_GPIO_FUNC_REG);

  /* 4. Prep P27 GPIO: disable output/input/pull before switching function
   *    (ARMino: gpio_hal_func_map -> gpio_hal_set_pull/ output_dis / input_dis)
   *    Saved in mclk_save_state(), restored in mclk_restore_state().
   */

  val = getreg32(BK7258_GPIO_CFG(CAMERA_MCLK_REQUIRED_PIN));
  val |=  GPIO_CFG_OUTPUT_EN;    /* bit3=1: output DISABLED (active-low) */
  val &= ~GPIO_CFG_INPUT_EN;     /* bit2=0: input disabled */
  val &= ~GPIO_CFG_PULL_EN;      /* bit5=0: pull disabled */
  val |=  GPIO_CFG_SECOND_FUNC;  /* bit6=1: peripheral function */
  putreg32(val, BK7258_GPIO_CFG(CAMERA_MCLK_REQUIRED_PIN));

  /* 5. Set clock source and divider - read-modify-write
   *    (ARMino: sys_drv_set_auxs_cis(3, 19))
   */

  val = getreg32(CAMERA_CLK_DIV_REG);
  val &= ~((CAMERA_CKSEL_MASK << CAMERA_CKSEL_POS) |
           (CAMERA_CKDIV_MASK << CAMERA_CKDIV_POS));
  val |= (CAMERA_CKSEL_AUXS_CIS << CAMERA_CKSEL_POS);
  val |= (CAMERA_CKDIV_24MHZ    << CAMERA_CKDIV_POS);
  putreg32(val, CAMERA_CLK_DIV_REG);

  /* 6. Enable clock gate - read-modify-write
   *    (ARMino: sys_drv_set_cis_auxs_clk_en(1))
   */

  val = getreg32(CAMERA_CLK_EN_REG);
  val |= CAMERA_CIS_AUXS_CKEN_BIT;
  putreg32(val, CAMERA_CLK_EN_REG);
}

/****************************************************************************
 * Power Control
 ****************************************************************************/

static void camera_power_on(gpio_state_t *pwr_saved, bool *pwr_ok,
                            gpio_state_t *pwdn_saved, bool *pwdn_ok)
{
  if (g_cam_pwr_pin != CAMERA_GPIO_UNCONFIGURED)
    {
      gpio_save_state(g_cam_pwr_pin, pwr_saved);
      *pwr_ok = true;

