yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
#ifdef CONFIG_CAMERA_PWR_ACTIVE_HIGH
      gpio_set_output_high(g_cam_pwr_pin);
#else
      gpio_drive_low(g_cam_pwr_pin);
#endif
      up_udelay(5000);
    }

  if (g_cam_pwdn_pin != CAMERA_GPIO_UNCONFIGURED)
    {
      gpio_save_state(g_cam_pwdn_pin, pwdn_saved);
      *pwdn_ok = true;

#ifdef CONFIG_CAMERA_PWDNB_ACTIVE_HIGH
      /* high=standby -> drive LOW to exit standby */

      gpio_drive_low(g_cam_pwdn_pin);
#else
      /* low=standby -> drive HIGH to exit standby */

      gpio_set_output_high(g_cam_pwdn_pin);
#endif
      up_udelay(1000);
    }
}

/****************************************************************************
 * Reset
 ****************************************************************************/

static void camera_reset(void)
{
#ifdef CONFIG_CAMERA_RST_ACTIVE_LOW
  gpio_drive_low(g_cam_rst_pin);
  up_udelay(10000);
  gpio_release(g_cam_rst_pin);
  up_udelay(5000);
#else
  gpio_set_output_high(g_cam_rst_pin);
  up_udelay(10000);
  gpio_drive_low(g_cam_rst_pin);
  up_udelay(5000);
#endif
}

/****************************************************************************
 * DVP Data Pin Mux (P29-P39)
 *
 * Configure 11 DVP data pins for camera use:
 *   P29=PCLK, P30=HSYNC, P31=VSYNC, P32-P39=PXDATA[0:7]
 *
 * Each pin:
 *   1. Save full CFG + 4-bit function field (for restore)
 *   2. Set function select = 0 (JPEG/DVP function)
 *   3. Set CFG: output_dis, input_dis, pull_dis, second_func=1
 *
 * Function select register layout (shared per 8 pins):
 *   P24-P31: SYS_BASE + 0xCC  (P27=MCLK uses func=1, others=0)
 *   P32-P39: SYS_BASE + 0xD0  (all use func=0)
 ****************************************************************************/

static int dvp_io_config(void)
{
  int i;
  uint32_t val;

  for (i = 0; i < DVP_PIN_COUNT; i++)
    {
      int pin = DVP_PIN_FIRST + i;

      /* Save CFG + function field for restore */

      gpio_save_state(pin, &g_dvp_state[i]);

      /* Set function select = 0 via field-level RMW */

      val = getreg32(BK7258_SYS_GPIO_FUNC(pin));
      val &= ~(0xFu << ((pin & 7) * 4));  /* clear function field */
      putreg32(val, BK7258_SYS_GPIO_FUNC(pin));

      /* Set CFG: disable output, disable input, disable pull, enable
       * second function (ARMino gpio_hal_func_map prep sequence).
       */

      val = getreg32(BK7258_GPIO_CFG(pin));
      val |=  GPIO_CFG_OUTPUT_EN;    /* bit3=1: output DISABLED (active-low) */
      val &= ~GPIO_CFG_INPUT_EN;     /* bit2=0: input disabled */
      val &= ~GPIO_CFG_PULL_EN;      /* bit5=0: pull disabled */
      val |=  GPIO_CFG_SECOND_FUNC;  /* bit6=1: peripheral function */
      putreg32(val, BK7258_GPIO_CFG(pin));
    }

  g_dvp_pins_configed = true;
  return 0;
}

static void dvp_io_deconfig(void)
{
  int i;

  if (!g_dvp_pins_configed) return;

  /* Restore in reverse order */

  for (i = DVP_PIN_COUNT - 1; i >= 0; i--)
    {
      gpio_restore_state(&g_dvp_state[i]);
    }

  g_dvp_pins_configed = false;
}

/****************************************************************************
 * GC2145 Write Table
 *
 * Write a register table to GC2145 via SCCB.
 * Reports NACK with register address and entry index for debugging.
 ****************************************************************************/

static int gc2145_write_table(const uint8_t (*table)[2], int count)
{
  int i, ret;

  for (i = 0; i < count; i++)
    {
      ret = sccb_write_reg(table[i][0], table[i][1]);
      if (ret < 0)
        {
          syslog(LOG_ERR,
                 "[camera] table[%d] reg 0x%02X NACK (err=%d)\n",
                 i, table[i][0], ret);
          return ret;
        }
    }

  return 0;
}

/****************************************************************************
 * PSRAM Frame Buffer
 *
 * Allocate two ping-pong frame buffers in PSRAM at 0x60000000.
 * Each buffer is 640 * 480 * 2 = 614400 bytes (VYUY).
 ****************************************************************************/

static int camera_framebuf_alloc(void)
{
  int ret;

  if (g_framebuf_allocated)
    {
      syslog(LOG_INFO, "[camera] Framebuf already allocated\n");
      return 0;
    }

  ret = bk7258_psram_init();
  if (ret < 0)
    {
      syslog(LOG_ERR, "[camera] PSRAM init failed: %d\n", ret);
      return ret;
    }

  g_camera_buf[0] = (volatile uint8_t *)(CAMERA_PSRAM_BASE);
  g_camera_buf[1] = (volatile uint8_t *)(CAMERA_PSRAM_BASE + CAMERA_FRAME_SIZE);
  g_framebuf_allocated = true;

  syslog(LOG_INFO,
         "[camera] Framebuf: buf0=0x%08lX buf1=0x%08lX size=%d\n",
         (unsigned long)g_camera_buf[0], (unsigned long)g_camera_buf[1],
         CAMERA_FRAME_SIZE);

  return 0;
}

static void camera_framebuf_free(void)
{
  g_camera_buf[0] = NULL;
  g_camera_buf[1] = NULL;
  g_framebuf_allocated = false;
}

/****************************************************************************
 * DVP Module Clock and Interrupt Enable
 *
 * From ARMino yuv_buf_driver.c:yuv_buf_init_common():
 *   1. Enable YUV_BUF power (PM voting - skipped, assume always on)
 *   2. Enable H264 clock (bit[0] of CLK_EN_REG) - needed for bus
 *   3. Enable YUV_BUF clock (bit[3] of CLK_EN_REG)
 *   4. Enable system interrupt (bit[26] of INT_32_63_EN_REG)
 *   5. Init global control (soft reset + clock gate bypass)
 *
 * All register writes use field-level RMW on shared registers.
 ****************************************************************************/

typedef struct
{
  uint32_t clk_en;       /* CLK_EN_REG bits we modify */
  uint32_t int_en;       /* INT_32_63_EN_REG bits we modify */
  uint32_t global_ctrl;  /* YUV_BUF REG_0x02 value */
  bool     valid;
} dvp_module_state_t;

static dvp_module_state_t g_dvp_module_saved = { .valid = false };
static bool g_dvp_module_enabled = false;

static int dvp_module_clk_enable(void)
{
  uint32_t val;

  if (g_dvp_module_enabled)
    {
      return 0;
    }

  /* Save register values for restore - only bits we modify */

  val = getreg32(CAMERA_CLK_EN_REG);
  g_dvp_module_saved.clk_en = val & (CAMERA_H264_CLKEN_BIT |
                                      CAMERA_YUV_BUF_CLKEN_BIT);

  val = getreg32(CAMERA_SYS_INT_32_63_REG);
  g_dvp_module_saved.int_en = val & CAMERA_YUVB_INT_EN_BIT;

  g_dvp_module_saved.global_ctrl = getreg32(YUV_BUF_REG_0x02);
  g_dvp_module_saved.valid = true;

