yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
  /* Step 1: Enable H264 clock - needed for YUV_BUF internal bus
   * From ARMino sys_drv_set_h264_clk_en(1)
   */

  val = getreg32(CAMERA_CLK_EN_REG);
  val |= CAMERA_H264_CLKEN_BIT;
  putreg32(val, CAMERA_CLK_EN_REG);

  /* Step 2: Enable YUV_BUF clock
   * From ARMino sys_drv_set_yuv_buf_clk_en(1)
   */

  val = getreg32(CAMERA_CLK_EN_REG);
  val |= CAMERA_YUV_BUF_CLKEN_BIT;
  putreg32(val, CAMERA_CLK_EN_REG);

  /* Step 3: Enable system interrupt for YUV_BUF
   * From ARMino sys_drv_int_group2_enable(YUV_BUF_INTERRUPT_CTRL_BIT)
   * YUV_BUF_INTERRUPT_CTRL_BIT = (1 << 26)
   */

  val = getreg32(CAMERA_SYS_INT_32_63_REG);
  val |= CAMERA_YUVB_INT_EN_BIT;
  putreg32(val, CAMERA_SYS_INT_32_63_REG);

  /* Step 4: Init global control - soft reset + clock gate bypass
   * From ARMino yuv_buf_ll_init():
   *   hw->global_ctrl.soft_reset = 0;    // assert reset
   *   hw->global_ctrl.soft_reset = 1;    // deassert reset
   *   hw->global_ctrl.clk_gate_bypass = 1; // bypass clock gate
   */

  val = getreg32(YUV_BUF_REG_0x02);
  val &= ~YUV_BUF_GLOBAL_SOFT_RESET;  /* assert reset */
  putreg32(val, YUV_BUF_REG_0x02);

  val |= YUV_BUF_GLOBAL_SOFT_RESET;   /* deassert reset */
  val |= YUV_BUF_GLOBAL_CLK_GATE;     /* bypass clock gate */
  putreg32(val, YUV_BUF_REG_0x02);

  g_dvp_module_enabled = true;

  syslog(LOG_INFO,
         "[camera] DVP module clock enabled: CLK_EN=0x%08lX INT_EN=0x%08lX\n",
         (unsigned long)getreg32(CAMERA_CLK_EN_REG),
         (unsigned long)getreg32(CAMERA_SYS_INT_32_63_REG));

  return 0;
}

static void dvp_module_clk_disable(void)
{
  uint32_t val;

  if (!g_dvp_module_enabled) return;

  /* Assert soft reset first */

  val = getreg32(YUV_BUF_REG_0x02);
  val &= ~YUV_BUF_GLOBAL_SOFT_RESET;
  putreg32(val, YUV_BUF_REG_0x02);

  /* Disable system interrupt for YUV_BUF */

  val = getreg32(CAMERA_SYS_INT_32_63_REG);
  val &= ~CAMERA_YUVB_INT_EN_BIT;
  val |= g_dvp_module_saved.int_en;  /* restore saved bits */
  putreg32(val, CAMERA_SYS_INT_32_63_REG);

  /* Disable YUV_BUF clock */

  val = getreg32(CAMERA_CLK_EN_REG);
  val &= ~CAMERA_YUV_BUF_CLKEN_BIT;
  val |= (g_dvp_module_saved.clk_en & CAMERA_YUV_BUF_CLKEN_BIT);
  putreg32(val, CAMERA_CLK_EN_REG);

  /* Disable H264 clock */

  val = getreg32(CAMERA_CLK_EN_REG);
  val &= ~CAMERA_H264_CLKEN_BIT;
  val |= (g_dvp_module_saved.clk_en & CAMERA_H264_CLKEN_BIT);
  putreg32(val, CAMERA_CLK_EN_REG);

  /* Restore global control register */

  putreg32(g_dvp_module_saved.global_ctrl, YUV_BUF_REG_0x02);

  g_dvp_module_enabled = false;

  syslog(LOG_INFO, "[camera] DVP module clock disabled\n");
}

/****************************************************************************
 * DVP Controller Configuration (CIS / YUV_BUF)
 *
 * The YUV_BUF controller at 0x48020000 captures DVP data and writes it
 * to external memory via its internal DMA.  Configuration steps:
 *   1. Save all register values for restore
 *   2. Set resolution (x_pixel = width/8, y_pixel = height/8)
 *   3. Set format (YUV mode, HW label "YUYV" — actual byte order VYUY)
 *   4. Set polarity (HSYNC/VSYNC/PCLK from Kconfig)
 *   5. Set frame buffer base address
 *   6. Start YUV mode (set yuv_mode bit in CTRL)
 *
 * All register writes use field-level RMW on shared registers.
 ****************************************************************************/

static void dvp_ctrl_save_state(dvp_ctrl_state_t *s)
{
  s->ctrl       = getreg32(YUV_BUF_REG_0x04);
  s->pixel      = getreg32(YUV_BUF_REG_0x05);
  s->em_base    = getreg32(YUV_BUF_REG_0x08);
  s->int_en     = getreg32(YUV_BUF_REG_0x09);
  s->int_status = getreg32(YUV_BUF_REG_0x0a);
  s->valid      = true;
}

static void dvp_ctrl_restore_state(const dvp_ctrl_state_t *s)
{
  if (!s->valid) return;

  /* Disable interrupts first */

  putreg32(0, YUV_BUF_REG_0x09);

  /* Clear any pending interrupt status */

  putreg32(YUV_BUF_INT_STATUS_MASK, YUV_BUF_REG_0x0a);

  /* Restore registers in order: CTRL, PIXEL, EM_BASE, INT_EN */

  putreg32(s->ctrl, YUV_BUF_REG_0x04);
  putreg32(s->pixel, YUV_BUF_REG_0x05);
  putreg32(s->em_base, YUV_BUF_REG_0x08);
  putreg32(s->int_en, YUV_BUF_REG_0x09);
}

/****************************************************************************
 * Name: dvp_ctrl_config
 *
 * Description:
 *   Configure the CIS controller (YUV_BUF) for DVP capture.
 *   Resolution: CAMERA_HRES x CAMERA_VRES (640x480).
 *   Format: YUV mode, HW label "YUYV" (actual PSRAM byte order: VYUY).
 *   Polarity: from Kconfig (CONFIG_DVP_PCLK_RISING, etc.).
 *
 *   The controller's internal DMA writes captured data to the address
 *   in em_base_addr.
 *
 * Input Parameters:
 *   em_base - External memory base address for frame buffer output
 *
 ****************************************************************************/

static int dvp_ctrl_config(uint32_t em_base)
{
  int ret;
  uint32_t val;
  uint32_t x_pixel;
  uint32_t y_pixel;
  uint32_t frame_blk;

  if (g_dvp_ctrl_configed)
    {
      syslog(LOG_WARNING, "[camera] DVP ctrl already configured\n");
      return 0;
    }

  /* Enable module clock and system interrupt FIRST
   * This must be done before accessing YUV_BUF registers.
   */

  ret = dvp_module_clk_enable();
  if (ret < 0)
    {
      syslog(LOG_ERR, "[camera] DVP module clock enable failed: %d\n", ret);
      return ret;
    }

  /* Save all register values for restore */

  dvp_ctrl_save_state(&g_dvp_ctrl_saved);

  /* Calculate pixel parameters
   * x_pixel = width / 8
   * y_pixel = height / 8
   * frame_blk = x_pixel * y_pixel / 2 (from ARMino yuv_buf_hal.c)
   */

  x_pixel   = CAMERA_HRES / 8;               /* 640/8 = 80 */
  y_pixel   = CAMERA_VRES / 8;               /* 480/8 = 60 */
  frame_blk = x_pixel * y_pixel / 2;         /* 80*60/2 = 2400 */

  /* Configure CTRL register (0x04)
   * Start from saved value to preserve reserved bits.
   * Then set/clear fields as needed.
   */

  val = g_dvp_ctrl_saved.ctrl;

  /* Enable YUV mode */

  val |= YUV_BUF_CTRL_YUV_MODE;

  /* Set YUV format to YUYV (controller default).
   * NOTE: actual byte order in PSRAM is VYUY: [V Y0 U Y1], Cr first.
   * The controller format field does NOT reorder bytes - it matches
   * whatever the sensor outputs.  Software conversion uses VYUY parsing.
   */

  val &= ~YUV_BUF_CTRL_FMT_SEL_MASK;
  val |= YUV_BUF_CTRL_FMT_YUYV;

  /* Set PCLK edge - default is rising edge sampling.
   * If CONFIG_DVP_PCLK_FALLING is set, invert to sample on falling edge.
   */

