yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
#ifdef CONFIG_DVP_PCLK_FALLING
  val |= YUV_BUF_CTRL_VCK_EDGE;   /* sample on falling edge */
#else
  val &= ~YUV_BUF_CTRL_VCK_EDGE;  /* sample on rising edge (default) */
#endif

  /* Set HSYNC polarity - default is active-high (not inverted).
   * If CONFIG_DVP_HSYNC_ACTIVE_LOW is set, invert HSYNC.
   */

#ifdef CONFIG_DVP_HSYNC_ACTIVE_LOW
  val |= YUV_BUF_CTRL_HSYNC_REV;
#else
  val &= ~YUV_BUF_CTRL_HSYNC_REV;
#endif

  /* Set VSYNC polarity - default is active-high (not inverted).
   * If CONFIG_DVP_VSYNC_ACTIVE_LOW is set, invert VSYNC.
   */

#ifdef CONFIG_DVP_VSYNC_ACTIVE_LOW
  val |= YUV_BUF_CTRL_VSYNC_REV;
#else
  val &= ~YUV_BUF_CTRL_VSYNC_REV;
#endif

  /* Disable H264 mode - we're doing raw YUV capture */

  val &= ~YUV_BUF_CTRL_H264_MODE;

  /* Disable memrev and byte_rev - ARMino disables these for normal
   * YUV capture mode.  Only enable in nosensor_encode mode.
   */

  val &= ~YUV_BUF_CTRL_MEMREV;
  val &= ~YUV_BUF_CTRL_BYTE_REV;

  /* Write CTRL register */

  putreg32(val, YUV_BUF_REG_0x04);

  /* Configure PIXEL register (0x05)
   * bit[7:0]   = x_pixel (width/8)
   * bit[15:8]  = y_pixel (height/8)
   * bit[31:16] = frame_blk (total blocks)
   */

  val = (x_pixel & YUV_BUF_PIXEL_X_MASK) |
        ((y_pixel << YUV_BUF_PIXEL_Y_POS) & YUV_BUF_PIXEL_Y_MASK) |
        ((frame_blk << YUV_BUF_PIXEL_BLK_POS) & YUV_BUF_PIXEL_BLK_MASK);

  putreg32(val, YUV_BUF_REG_0x05);

  /* Set external memory base address (0x08) */

  putreg32(em_base, YUV_BUF_REG_0x08);

  /* Clear any pending interrupt status */

  putreg32(YUV_BUF_INT_STATUS_MASK, YUV_BUF_REG_0x0a);

  /* Start YUV mode - set bit[0] of CTRL (yuv_mode)
   * From ARMino bk_yuv_buf_start(YUV_MODE) -> yuv_buf_hal_start_yuv_mode()
   *   yuv_buf_ll_enable_yuv_buf_mode(hal->hw);  // bit[0] = 1
   *   yuv_buf_ll_disable_h264_encode_mode(hal->hw); // bit[3] = 0
   */

  val = getreg32(YUV_BUF_REG_0x04);
  val |= YUV_BUF_CTRL_YUV_MODE;     /* enable YUV buf mode */
  val &= ~YUV_BUF_CTRL_H264_MODE;   /* disable H264 mode */
  putreg32(val, YUV_BUF_REG_0x04);

  g_dvp_ctrl_configed = true;

  syslog(LOG_INFO,
         "[camera] DVP ctrl config: %dx%d xpix=%lu ypix=%lu blk=%lu "
         "em_base=0x%08lX\n",
         CAMERA_HRES, CAMERA_VRES,
         (unsigned long)x_pixel, (unsigned long)y_pixel,
         (unsigned long)frame_blk,
         (unsigned long)em_base);

  return 0;
}

/****************************************************************************
 * Name: dvp_ctrl_deconfig
 *
 * Description:
 *   Restore all CIS controller registers to their saved values.
 *   Disables interrupts and clears pending status before restore.
 *
 ****************************************************************************/

static void dvp_ctrl_deconfig(void)
{
  if (!g_dvp_ctrl_configed) return;

  dvp_ctrl_restore_state(&g_dvp_ctrl_saved);
  g_dvp_ctrl_configed = false;

  /* Disable module clock after restoring registers */

  dvp_module_clk_disable();
}

/****************************************************************************
 * Frame Consumer API (critical-section protected)
 ****************************************************************************/

static uint32_t dvp_frame_get(void)
{
  irqstate_t flags;
  int idx;
  uint32_t addr;

  flags = enter_critical_section();
  idx = g_ready_buf;
  if (idx >= 0)
    {
      g_busy_buf  = idx;
      g_ready_buf = -1;
      addr = (uint32_t)(uintptr_t)g_camera_buf[idx];
    }
  else
    {
      addr = 0;
    }

  leave_critical_section(flags);
  return addr;
}

static void dvp_frame_put(void)
{
  irqstate_t flags;

  flags = enter_critical_section();
  g_busy_buf = -1;
  leave_critical_section(flags);
}

/****************************************************************************
 * Name: dvp_irq_handler
 *
 * Description:
 *   ISR for DVP (YUV_BUF) controller interrupts.
 *   Handles VSYNC falling edge (frame start) and YUV arrived (frame done).
 *
 ****************************************************************************/

static int dvp_irq_handler(int irq, void *context, void *arg)
{
  uint32_t status;

  /* Read interrupt status */

  status = getreg32(YUV_BUF_REG_0x0a);

  /* VSYNC falling edge - frame start */

  if (status & YUV_BUF_INT_VSYNC_NEGE)
    {
      g_dvp_vsync_count++;
    }

  /* YUV arrived - frame data written to memory */

  if (status & YUV_BUF_INT_YUV_ARV)
    {
      g_dvp_frame_count++;

      /* Ping-pong: if streaming, advance to next buffer */

      if (g_stream_active)
        {
          int next_buf = 1 - g_cur_buf;

          if (g_ready_buf < 0 && next_buf != g_busy_buf)
            {
              g_ready_buf = g_cur_buf;
              g_cur_buf = next_buf;
              g_pingpong_count++;
              putreg32((uint32_t)(uintptr_t)g_camera_buf[g_cur_buf],
                       YUV_BUF_REG_0x08);
            }
          else
            {
              g_drop_count++;
            }
        }
    }

  /* Clear all pending interrupts by writing 1s */

  putreg32(status & YUV_BUF_INT_STATUS_MASK, YUV_BUF_REG_0x0a);

  return OK;
}

/****************************************************************************
 * Name: dvp_irq_attach
 *
 * Description:
 *   Attach DVP interrupt handler and enable VSYNC + YUV_ARRIVED interrupts.
 *
 ****************************************************************************/

static int dvp_irq_attach(void)
{
  int ret;

  if (g_dvp_irq_attached)
    {
      syslog(LOG_WARNING, "[camera] DVP IRQ already attached\n");
      return 0;
    }

  /* Reset counters */

  g_dvp_vsync_count = 0;
  g_dvp_hsync_count = 0;
  g_dvp_frame_count = 0;

  /* Attach ISR */

  ret = irq_attach(BK7258_IRQ_YUV_BUF, dvp_irq_handler, NULL);
  if (ret < 0)
    {
      syslog(LOG_ERR, "[camera] irq_attach failed: %d\n", ret);
      return ret;
    }

  /* Enable VSYNC falling edge and YUV arrived interrupts */

  putreg32(YUV_BUF_INT_VSYNC_NEGE | YUV_BUF_INT_YUV_ARV,
           YUV_BUF_REG_0x09);

  /* Enable the IRQ in NVIC */

  up_enable_irq(BK7258_IRQ_YUV_BUF);

  g_dvp_irq_attached = true;

  syslog(LOG_INFO, "[camera] DVP IRQ attached (IRQ %d)\n",
         BK7258_IRQ_YUV_BUF);

