yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
  return 0;
}

/****************************************************************************
 * Name: dvp_irq_detach
 *
 * Description:
 *   Disable DVP interrupts and detach the ISR.
 *
 ****************************************************************************/

static void dvp_irq_detach(void)
{
  if (!g_dvp_irq_attached) return;

  /* Disable IRQ in NVIC */

  up_disable_irq(BK7258_IRQ_YUV_BUF);

  /* Disable all DVP interrupts */

  putreg32(0, YUV_BUF_REG_0x09);

  /* Clear any pending status */

  putreg32(YUV_BUF_INT_STATUS_MASK, YUV_BUF_REG_0x0a);

  /* Detach ISR - restore default handler */

  irq_detach(BK7258_IRQ_YUV_BUF);

  g_dvp_irq_attached = false;

  syslog(LOG_INFO, "[camera] DVP IRQ detached\n");
}

/****************************************************************************
 * Config Validation
 ****************************************************************************/

static int camera_check_config(void)
{
  bool ok = true;

#ifdef CONFIG_CAMERA_SCCB_CONFIRMED
  const char *sccb_st = "y";
#else
  const char *sccb_st = "n";
#endif
#ifdef CONFIG_CAMERA_SDA_SCL_ROLE_CONFIRMED
  const char *role_st = "y";
#else
  const char *role_st = "n";
#endif
#ifdef CONFIG_CAMERA_RST_GPIO_CONFIRMED
  const char *rst_g_st = "y";
#else
  const char *rst_g_st = "n";
#endif
#ifdef CONFIG_CAMERA_RST_POLARITY_CONFIRMED
  const char *rst_p_st = "y";
#else
  const char *rst_p_st = "n";
#endif
#ifdef CONFIG_CAMERA_PWR_CONFIRMED
  const char *pwr_st = "y";
#else
  const char *pwr_st = "n";
#endif
#ifdef CONFIG_CAMERA_PWR_POLARITY_CONFIRMED
  const char *pwr_p_st = "y";
#else
  const char *pwr_p_st = "n";
#endif
#ifdef CONFIG_CAMERA_MCLK_CONFIRMED
  const char *mclk_st = "y";
#else
  const char *mclk_st = "n";
#endif

  syslog(LOG_INFO,
         "[camera] Config: SDA=%d(net=%s role=%s) SCL=%d "
         "RST=%d(gpio=%s pol=%s) PWR=%d(net=%s pol=%s) "
         "MCLK=%d(conf=%s)\n",
         g_cam_sda_pin, sccb_st, role_st,
         g_cam_scl_pin,
         g_cam_rst_pin, rst_g_st, rst_p_st,
         g_cam_pwr_pin, pwr_st, pwr_p_st,
         g_cam_mclk_pin, mclk_st);

  /* Stage 1: 7 confirmed sentinels */

#ifndef CONFIG_CAMERA_SCCB_CONFIRMED
  syslog(LOG_ERR, "[camera] BLOCKER: SCCB net NOT confirmed\n"); ok = false;
#endif
#ifndef CONFIG_CAMERA_SDA_SCL_ROLE_CONFIRMED
  syslog(LOG_ERR, "[camera] BLOCKER: SDA/SCL role NOT confirmed\n"); ok = false;
#endif
#ifndef CONFIG_CAMERA_RST_GPIO_CONFIRMED
  syslog(LOG_ERR, "[camera] BLOCKER: RST GPIO NOT confirmed\n"); ok = false;
#endif
#ifndef CONFIG_CAMERA_RST_POLARITY_CONFIRMED
  syslog(LOG_ERR, "[camera] BLOCKER: RST polarity NOT confirmed\n"); ok = false;
#endif
#ifndef CONFIG_CAMERA_PWR_CONFIRMED
  syslog(LOG_ERR, "[camera] BLOCKER: PWR net NOT confirmed\n"); ok = false;
#endif
#ifndef CONFIG_CAMERA_PWR_POLARITY_CONFIRMED
  syslog(LOG_ERR, "[camera] BLOCKER: PWR polarity NOT confirmed\n"); ok = false;
#endif
#ifndef CONFIG_CAMERA_MCLK_CONFIRMED
  syslog(LOG_ERR, "[camera] BLOCKER: MCLK NOT confirmed\n"); ok = false;
#endif

  if (!ok)
    {
      syslog(LOG_ERR,
             "[camera] ======== 7 BLOCKERS - no MMIO touched ========\n");
      return -ENOTSUP;
    }

  /* Stage 2: GPIO range + uniqueness */

  if (!gpio_is_valid(g_cam_sda_pin))
    { syslog(LOG_ERR, "[camera] SDA pin %d out of range\n", g_cam_sda_pin);
      ok = false; }
  if (!gpio_is_valid(g_cam_scl_pin))
    { syslog(LOG_ERR, "[camera] SCL pin %d out of range\n", g_cam_scl_pin);
      ok = false; }
  if (gpio_is_valid(g_cam_sda_pin) && gpio_is_valid(g_cam_scl_pin) &&
      g_cam_sda_pin == g_cam_scl_pin)
    { syslog(LOG_ERR, "[camera] SDA=SCL=%d conflict\n", g_cam_sda_pin);
      ok = false; }
  if (g_cam_rst_pin != CAMERA_GPIO_UNCONFIGURED &&
      !gpio_is_valid(g_cam_rst_pin))
    { syslog(LOG_ERR, "[camera] RST pin %d out of range\n", g_cam_rst_pin);
      ok = false; }
  if (g_cam_pwr_pin != CAMERA_GPIO_UNCONFIGURED &&
      !gpio_is_valid(g_cam_pwr_pin))
    { syslog(LOG_ERR, "[camera] PWR pin %d out of range\n", g_cam_pwr_pin);
      ok = false; }
  if (g_cam_pwdn_pin != CAMERA_GPIO_UNCONFIGURED &&
      !gpio_is_valid(g_cam_pwdn_pin))
    { syslog(LOG_ERR, "[camera] PWDN pin %d out of range\n", g_cam_pwdn_pin);
      ok = false; }
  if (g_cam_mclk_pin != CAMERA_GPIO_UNCONFIGURED &&
      !gpio_is_valid(g_cam_mclk_pin))
    { syslog(LOG_ERR, "[camera] MCLK pin %d out of range\n", g_cam_mclk_pin);
      ok = false; }

  {
    int pins[6];
    int n = 0;
    int i, j;

    if (gpio_is_valid(g_cam_sda_pin))  pins[n++] = g_cam_sda_pin;
    if (gpio_is_valid(g_cam_scl_pin))  pins[n++] = g_cam_scl_pin;
    if (g_cam_rst_pin != CAMERA_GPIO_UNCONFIGURED &&
        gpio_is_valid(g_cam_rst_pin))  pins[n++] = g_cam_rst_pin;
    if (g_cam_pwr_pin != CAMERA_GPIO_UNCONFIGURED &&
        gpio_is_valid(g_cam_pwr_pin))  pins[n++] = g_cam_pwr_pin;
    if (g_cam_pwdn_pin != CAMERA_GPIO_UNCONFIGURED &&
        gpio_is_valid(g_cam_pwdn_pin)) pins[n++] = g_cam_pwdn_pin;
    if (g_cam_mclk_pin != CAMERA_GPIO_UNCONFIGURED &&
        gpio_is_valid(g_cam_mclk_pin)) pins[n++] = g_cam_mclk_pin;

    for (i = 0; i < n; i++)
      for (j = i + 1; j < n; j++)
        if (pins[i] == pins[j])
          { syslog(LOG_ERR, "[camera] pin %d multi-role\n", pins[i]);
            ok = false; }
  }

  /* Stage 3: board-level reserved pin conflicts */

  {
    static const struct { int pin; const char *name; } rsv[] = {
      { CAMERA_PIN_UART0_RX, "UART0 RX" },
      { CAMERA_PIN_UART0_TX, "UART0 TX" },
      { CAMERA_PIN_SWD_CLK,  "SWD CLK"  },
      { CAMERA_PIN_SWD_IO,   "SWD IO"   },
      { 2,  "LCD left SCLK"  },
      { 3,  "LCD left CS"    },
      { 4,  "LCD left MOSI"  },
      { 5,  "LCD left DC"    },
      { 6,  "LCD right SCLK" },
      { 7,  "LCD right CS"   },
      { 22, "LCD right MOSI" },
      { 23, "LCD right DC"   },
      { 24, "LCD right RST"  },
      { 25, "LCD backlight"  },
      { 45, "LCD left RST"   },
      { 52, "LCD LDO_3V3_EN" },
    };

    static const int cpins[] = {
      CONFIG_CAMERA_GPIO_SDA,
      CONFIG_CAMERA_GPIO_SCL,
      CONFIG_CAMERA_GPIO_RST,
      CONFIG_CAMERA_GPIO_PWR_CTL,
      CONFIG_CAMERA_GPIO_PWDNB,
      CONFIG_CAMERA_MCLK_GPIO,
    };

