yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
    int i, r;
    for (i = 0; i < 6; i++)
      {
        if (cpins[i] == CAMERA_GPIO_UNCONFIGURED) continue;
        for (r = 0; r < (int)(sizeof(rsv) / sizeof(rsv[0])); r++)
          {
            if (cpins[i] == rsv[r].pin)
              {
                syslog(LOG_ERR,
                       "[camera] pin %d conflicts with %s\n",
                       cpins[i], rsv[r].name);
                ok = false;
              }
          }
      }

    /* Reject control pins (SDA/SCL/RST/PWR/MCLK) on DVP reserved range
     * P29-P39.  DVP DATA pins on P29-P39 are expected and allowed.
     */

    for (i = 0; i < 6; i++)
      {
        if (cpins[i] == CAMERA_GPIO_UNCONFIGURED) continue;
        if (cpins[i] >= DVP_PIN_FIRST && cpins[i] <= DVP_PIN_LAST)
          {
            syslog(LOG_ERR,
                   "[camera] control pin %d in DVP range P%d-P%d\n",
                   cpins[i], DVP_PIN_FIRST, DVP_PIN_LAST);
            ok = false;
          }
      }
  }

  /* Stage 4: MCLK must be P27 */

#ifdef CONFIG_CAMERA_MCLK_CONFIRMED
  if (g_cam_mclk_pin != CAMERA_MCLK_REQUIRED_PIN)
    {
      syslog(LOG_ERR,
             "[camera] MCLK_GPIO=%d but code requires %d (P27)\n",
             g_cam_mclk_pin, CAMERA_MCLK_REQUIRED_PIN);
      ok = false;
    }
#endif

  if (!ok)
    {
      syslog(LOG_ERR,
             "[camera] Cannot proceed - no MMIO touched.\n");
      return -ENODEV;
    }

  return 0;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: bk7258_camera_id
 *   Phase 0: read GC2145 chip ID via SCCB.  Restores all pins on exit.
 ****************************************************************************/

int bk7258_camera_id(void)
{
  gpio_state_t sda_saved, scl_saved, rst_saved;
  gpio_state_t pwr_saved, pwdn_saved;
  mclk_state_t mclk_saved = { .valid = false };
  int id_h = -1, id_l = -1;
  uint16_t chip_id;
  int ret, stop_ret;
  bool sda_ok = false, scl_ok = false, rst_ok = false;
  bool pwr_ok = false, pwdn_ok = false;
  bool mclk_on = false;

  /* ===== Config validation - NO MMIO before this ===== */

  ret = camera_check_config();
  if (ret < 0) return ret;

  syslog(LOG_INFO, "[camera] Config OK\n");

  /* ===== GPIO setup ===== */

  gpio_save_state(g_cam_sda_pin, &sda_saved); sda_ok = true;
  gpio_save_state(g_cam_scl_pin, &scl_saved); scl_ok = true;

  gpio_release(g_cam_sda_pin);
  gpio_release(g_cam_scl_pin);
  up_udelay(100);

  if (g_cam_rst_pin != CAMERA_GPIO_UNCONFIGURED)
    { gpio_save_state(g_cam_rst_pin, &rst_saved); rst_ok = true; }

  camera_power_on(&pwr_saved, &pwr_ok, &pwdn_saved, &pwdn_ok);

  if (g_cam_mclk_pin != CAMERA_GPIO_UNCONFIGURED)
    { mclk_save_state(&mclk_saved);
      mclk_enable_24mhz(); mclk_on = true;
      up_udelay(500); }

  if (rst_ok) camera_reset();

  /* ===== SCCB ID read ===== */

  id_h = sccb_read_reg(GC2145_REG_ID_H);
  if (id_h < 0)
    { syslog(LOG_ERR, "[camera] ID high read fail: %d\n", id_h);
      ret = id_h; goto cleanup; }

  id_l = sccb_read_reg(GC2145_REG_ID_L);
  if (id_l < 0)
    { syslog(LOG_ERR, "[camera] ID low read fail: %d\n", id_l);
      ret = id_l; goto cleanup; }

  chip_id = (uint16_t)((id_h << 8) | id_l);
  syslog(LOG_INFO,
         "[camera] GC2145 ID: 0x%04X (0xF0=0x%02X 0xF1=0x%02X)\n",
         chip_id, (uint8_t)id_h, (uint8_t)id_l);

  ret = (chip_id == 0x2145) ? 0 : -ENODEV;

cleanup:

  /* ===== Restore ALL saved GPIO states ===== */

  stop_ret = sccb_stop();

  if (mclk_on)     mclk_restore_state(&mclk_saved);
  if (rst_ok)      gpio_restore_state(&rst_saved);
  if (pwdn_ok)     gpio_restore_state(&pwdn_saved);
  if (pwr_ok)      gpio_restore_state(&pwr_saved);
  if (scl_ok)      gpio_restore_state(&scl_saved);
  if (sda_ok)      gpio_restore_state(&sda_saved);

  syslog(LOG_INFO, "[camera] Cleanup done - pins restored\n");

  if (ret == 0 && stop_ret < 0) ret = stop_ret;

  return ret;
}

/****************************************************************************
 * Name: bk7258_camera_io
 *   Phase 1 Step 1: configure DVP data pins (P29-P39), readback verify,
 *   deconfigure, readback verify restore.
 ****************************************************************************/

int bk7258_camera_io(void)
{
  int ret, i;
  uint32_t val, expected;

  ret = camera_check_config();
  if (ret < 0) return ret;

  /* Config DVP pins */

  ret = dvp_io_config();
  if (ret < 0) return ret;

  /* Readback verify: second_func=1, input_en=0, output_en=1(disabled) */

  for (i = 0; i < DVP_PIN_COUNT; i++)
    {
      int pin = DVP_PIN_FIRST + i;
      val = getreg32(BK7258_GPIO_CFG(pin));
      if (!(val & GPIO_CFG_SECOND_FUNC))
        {
          syslog(LOG_ERR, "[camera] P%d second_func not set: 0x%08X\n",
                 pin, val);
          ret = -EIO;
          goto cleanup;
        }
      if (val & GPIO_CFG_INPUT_EN)
        {
          syslog(LOG_ERR, "[camera] P%d input_en still set: 0x%08X\n",
                 pin, val);
          ret = -EIO;
          goto cleanup;
        }
    }

  syslog(LOG_INFO, "[camera] DVP IO config readback OK (P29-P39)\n");

cleanup:
  /* Deconfig and verify restore */

  dvp_io_deconfig();

  for (i = 0; i < DVP_PIN_COUNT; i++)
    {
      int pin = DVP_PIN_FIRST + i;
      val = getreg32(BK7258_GPIO_CFG(pin));
      expected = g_dvp_state[i].cfg;
      if (val != expected)
        {
          syslog(LOG_ERR,
                 "[camera] P%d CFG restore mismatch: 0x%08X vs 0x%08X\n",
                 pin, val, expected);
          if (ret == 0) ret = -EIO;
        }
    }

  if (ret == 0)
    syslog(LOG_INFO, "[camera] DVP IO deconfig readback OK\n");

  return ret;
}

/****************************************************************************
 * Name: bk7258_camera_init
 *   Phase 1 Step 2: power on, MCLK, reset, read ID, write GC2145 init
 *   table (640x480), readback verify, keep MCLK/power on for
 *   oscilloscope verification.
 ****************************************************************************/

