yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
int bk7258_camera_init(void)
{
  gpio_state_t sda_saved, scl_saved, rst_saved;
  gpio_state_t pwr_saved, pwdn_saved;
  mclk_state_t mclk_saved = { .valid = false };
  int id_h, id_l;
  uint16_t chip_id;
  int ret, stop_ret;
  bool sda_ok = false, scl_ok = false, rst_ok = false;
  bool pwr_ok = false, pwdn_ok = false;
  bool mclk_on = false;
  bool dvp_ok = false;

  /* ===== Config validation ===== */

  ret = camera_check_config();
  if (ret < 0) return ret;

  /* ===== DVP data pin mux ===== */

  ret = dvp_io_config();
  if (ret < 0) return ret;
  dvp_ok = true;

  /* ===== SCCB pin setup ===== */

  gpio_save_state(g_cam_sda_pin, &sda_saved); sda_ok = true;
  gpio_save_state(g_cam_scl_pin, &scl_saved); scl_ok = true;
  gpio_release(g_cam_sda_pin);
  gpio_release(g_cam_scl_pin);
  up_udelay(100);

  /* ===== RST, power, MCLK ===== */

  if (g_cam_rst_pin != CAMERA_GPIO_UNCONFIGURED)
    { gpio_save_state(g_cam_rst_pin, &rst_saved); rst_ok = true; }

  camera_power_on(&pwr_saved, &pwr_ok, &pwdn_saved, &pwdn_ok);

  if (g_cam_mclk_pin != CAMERA_GPIO_UNCONFIGURED)
    { mclk_save_state(&mclk_saved);
      mclk_enable_24mhz(); mclk_on = true;
      up_udelay(500); }

  if (rst_ok) camera_reset();

  /* ===== Read chip ID ===== */

  id_h = sccb_read_reg(GC2145_REG_ID_H);
  if (id_h < 0)
    { syslog(LOG_ERR, "[camera] ID high read fail: %d\n", id_h);
      ret = id_h; goto cleanup; }

  id_l = sccb_read_reg(GC2145_REG_ID_L);
  if (id_l < 0)
    { syslog(LOG_ERR, "[camera] ID low read fail: %d\n", id_l);
      ret = id_l; goto cleanup; }

  chip_id = (uint16_t)((id_h << 8) | id_l);
  if (chip_id != 0x2145)
    {
      syslog(LOG_ERR, "[camera] Bad ID: 0x%04X (expected 0x2145)\n",
             chip_id);
      ret = -ENODEV;
      goto cleanup;
    }

  syslog(LOG_INFO, "[camera] GC2145 ID OK: 0x%04X\n", chip_id);

  /* ===== Write init table ===== */

  ret = gc2145_write_table(gc2145_init,
                           sizeof(gc2145_init) / sizeof(gc2145_init[0]));
  if (ret < 0)
    {
      syslog(LOG_ERR, "[camera] Init table write failed\n");
      goto cleanup;
    }

  syslog(LOG_INFO, "[camera] Init table written (%d entries)\n",
         (int)(sizeof(gc2145_init) / sizeof(gc2145_init[0])));

  /* ===== Write 640x480 resolution table ===== */

  ret = gc2145_write_table(gc2145_640x480,
                           sizeof(gc2145_640x480) / sizeof(gc2145_640x480[0]));
  if (ret < 0)
    {
      syslog(LOG_ERR, "[camera] 640x480 table write failed\n");
      goto cleanup;
    }

  syslog(LOG_INFO, "[camera] 640x480 table written (%d entries)\n",
         (int)(sizeof(gc2145_640x480) / sizeof(gc2145_640x480[0])));

  /* ===== Readback verify: key registers ===== */

  {
    int val84 = sccb_read_reg(0x84);
    if (val84 < 0)
      {
        syslog(LOG_ERR, "[camera] Reg 0x84 readback fail: %d\n", val84);
        ret = val84;
        goto cleanup;
      }
    if (val84 != 0x02)
      {
        syslog(LOG_ERR,
               "[camera] Reg 0x84 mismatch: 0x%02X (expected 0x02)\n",
               val84);
        ret = -EIO;
        goto cleanup;
      }
  }

  {
    int val97 = sccb_read_reg(0x97);
    if (val97 < 0)
      {
        syslog(LOG_ERR, "[camera] Reg 0x97 readback fail: %d\n", val97);
        ret = val97;
        goto cleanup;
      }
    if (val97 != 0x02)
      {
        syslog(LOG_ERR,
               "[camera] Reg 0x97 mismatch: 0x%02X (expected 0x02=HOUT hi)\n",
               val97);
        ret = -EIO;
        goto cleanup;
      }
  }

  syslog(LOG_INFO,
         "[camera] GC2145 init complete - 640x480 VYUY\n");
  syslog(LOG_INFO,
         "[camera] MCLK/power left ON for oscilloscope verification\n");

  /* Restore SCCB pins only - MCLK and power stay ON */

  stop_ret = sccb_stop();
  if (scl_ok) gpio_restore_state(&scl_saved);
  if (sda_ok) gpio_restore_state(&sda_saved);

  return 0;

cleanup:

  stop_ret = sccb_stop();
  if (mclk_on)     mclk_restore_state(&mclk_saved);
  if (rst_ok)      gpio_restore_state(&rst_saved);
  if (pwdn_ok)     gpio_restore_state(&pwdn_saved);
  if (pwr_ok)      gpio_restore_state(&pwr_saved);
  if (scl_ok)      gpio_restore_state(&scl_saved);
  if (sda_ok)      gpio_restore_state(&sda_saved);
  if (dvp_ok)      dvp_io_deconfig();

  return ret;
}

/****************************************************************************
 * Name: bk7258_camera_stop
 *   Turn off MCLK, power off, deconfig DVP pins, free frame buffers.
 ****************************************************************************/

int bk7258_camera_stop(void)
{
  uint32_t val;

  /* Detach DVP IRQ first - stop interrupts before modifying registers */

  dvp_irq_detach();

  /* Restore DVP controller registers and disable module clock */

  dvp_ctrl_deconfig();

  /* Also disable module clock in case dvp_ctrl_config was never called
   * but dvp_module_clk_enable was called directly.
   */

  dvp_module_clk_disable();

  /* Turn off MCLK gate */

  val = getreg32(CAMERA_CLK_EN_REG);
  val &= ~CAMERA_CIS_AUXS_CKEN_BIT;
  putreg32(val, CAMERA_CLK_EN_REG);

  /* Power off - drive PWR pin inactive */

  if (g_cam_pwr_pin != CAMERA_GPIO_UNCONFIGURED)
    {
#ifdef CONFIG_CAMERA_PWR_ACTIVE_HIGH
      gpio_drive_low(g_cam_pwr_pin);
#else
      gpio_set_output_high(g_cam_pwr_pin);
#endif
    }

  /* Deconfig DVP pins */

  dvp_io_deconfig();

  /* Free frame buffers */

  camera_framebuf_free();

  syslog(LOG_INFO, "[camera] Stopped - MCLK off, power off, pins restored\n");
  return 0;
}

/****************************************************************************
 * Name: bk7258_camera_buf
 *   Phase 1 Step 3: init PSRAM, allocate two frame buffers, write test
 *   pattern to buf[0], sampled readback verify.
 ****************************************************************************/

int bk7258_camera_buf(void)
{
  int ret, i;
  volatile uint8_t *buf;

  ret = camera_framebuf_alloc();
  if (ret < 0) return ret;

  /* Write test pattern to buf[0] */

  buf = g_camera_buf[0];
  for (i = 0; i < CAMERA_FRAME_SIZE; i++)
    {
      buf[i] = (uint8_t)(i & 0xFF);
    }

  /* Readback verify:
   *   - First 256 bytes: full check
   *   - Last 256 bytes: full check
   *   - Every 1024 bytes: sampled check
   */

  for (i = 0; i < CAMERA_FRAME_SIZE; i++)
    {
      bool check = false;

      if (i < 256)                              check = true;
      else if (i >= CAMERA_FRAME_SIZE - 256)    check = true;
      else if ((i & 1023) == 0)                 check = true;

      if (check && buf[i] != (uint8_t)(i & 0xFF))
        {
          syslog(LOG_ERR,
                 "[camera] Framebuf[%d] mismatch: 0x%02X vs 0x%02X\n",
                 i, buf[i], (uint8_t)(i & 0xFF));
          return -EIO;
        }
    }

  syslog(LOG_INFO,
         "[camera] Framebuf verify OK (%d bytes, buf0=0x%08lX)\n",
         CAMERA_FRAME_SIZE, (unsigned long)g_camera_buf[0]);

