yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
  return 0;
}

/****************************************************************************
 * Name: bk7258_camera_dvp_active
 *   Runtime flag: returns true if DVP data pins (P29-P39) are currently
 *   configured.  Used by lcdtest for mutual exclusion.
 ****************************************************************************/

bool bk7258_camera_dvp_active(void)
{
  return g_dvp_pins_configed;
}

/****************************************************************************
 * Name: bk7258_camera_sync
 *
 * Description:
 *   Phase 1 Round 2 Step 4a: DVP controller config + interrupt counting.
 *
 *   Configures the CIS controller (YUV_BUF) for 640x480 YUV capture,
 *   attaches VSYNC/YUV_ARRIVED interrupt handlers, and waits for a
 *   configurable number of VSYNC edges (default 10) to verify the
 *   camera is producing valid sync signals.
 *
 *   Prerequisites: camera init must have been run (MCLK on, GC2145
 *   configured for output).  Frame buffers must be allocated.
 *
 *   On exit: interrupts are detached, controller registers restored.
 *
 ****************************************************************************/

int bk7258_camera_sync(void)
{
  int ret;
  int timeout_ms;
  uint32_t vsync_target;
  uint32_t vsync_prev;
  uint32_t vsync_now;

  /* Check DVP pins are configured (camera init must have been run) */

  if (!g_dvp_pins_configed)
    {
      syslog(LOG_ERR,
             "[camera] DVP pins not configured - run 'camera init' first\n");
      return -ENODEV;
    }

  /* Check frame buffers allocated */

  if (!g_framebuf_allocated)
    {
      syslog(LOG_ERR,
             "[camera] Frame buffers not allocated - run 'camera buf' first\n");
      return -ENOMEM;
    }

  /* Configure DVP controller - use buf[0] as output target.
   * The controller needs a valid em_base_addr even for sync-only test.
   */

  ret = dvp_ctrl_config((uint32_t)(uintptr_t)g_camera_buf[0]);
  if (ret < 0)
    {
      syslog(LOG_ERR, "[camera] DVP ctrl config failed: %d\n", ret);
      goto cleanup_ctrl;
    }

  /* Attach interrupt handler and enable interrupts */

  ret = dvp_irq_attach();
  if (ret < 0)
    {
      syslog(LOG_ERR, "[camera] DVP IRQ attach failed: %d\n", ret);
      goto cleanup_irq;
    }

  /* Wait for VSYNC edges - timeout 5 seconds */

  vsync_target = 10;
  timeout_ms   = 5000;
  vsync_prev   = g_dvp_vsync_count;

  syslog(LOG_INFO,
         "[camera] Waiting for %lu VSYNC edges (timeout %d ms)...\n",
         (unsigned long)vsync_target, timeout_ms);

  while (timeout_ms > 0)
    {
      vsync_now = g_dvp_vsync_count;
      if (vsync_now >= vsync_target)
        {
          break;
        }

      /* Print progress every 100 VSYNC edges */

      if (vsync_now != vsync_prev && (vsync_now % 100) == 0)
        {
          syslog(LOG_INFO, "[camera] VSYNC count: %lu\n",
                 (unsigned long)vsync_now);
          vsync_prev = vsync_now;
        }

      up_udelay(1000);  /* 1 ms */
      timeout_ms--;
    }

  /* Report results */

  vsync_now = g_dvp_vsync_count;

  syslog(LOG_INFO,
         "[camera] Sync result: VSYNC=%lu YUV_ARRIVED=%lu (target=%lu)\n",
         (unsigned long)vsync_now,
         (unsigned long)g_dvp_frame_count,
         (unsigned long)vsync_target);

  if (vsync_now < vsync_target)
    {
      syslog(LOG_ERR,
             "[camera] TIMEOUT: only %lu VSYNC edges in 5s "
             "(expected %lu)\n",
             (unsigned long)vsync_now, (unsigned long)vsync_target);
      syslog(LOG_ERR,
             "[camera] Check: MCLK on P27, sensor powered, "
             "DVP pins P29-P39\n");
      ret = -ETIMEDOUT;
    }
  else
    {
      syslog(LOG_INFO, "[camera] DVP sync OK - %lu VSYNC edges captured\n",
             (unsigned long)vsync_now);
      ret = 0;
    }

cleanup_irq:
  /* Always detach IRQ in sync test - we don't keep it running */

  dvp_irq_detach();

cleanup_ctrl:
  /* Always restore controller registers */

  dvp_ctrl_deconfig();

  return ret;
}

/****************************************************************************
 * Name: bk7258_camera_grab
 *
 * Description:
 *   Phase 1 Round 2 Step 4b: DMA single frame capture to PSRAM.
 *
 *   Configures the CIS controller, attaches interrupts, fills the
 *   target buffer with 0x5A pattern, waits for one complete frame
 *   (YUV_ARRIVED interrupt), then hexdumps the first 256 bytes.
 *
 *   Prerequisites: camera init + camera buf must have been run.
 *
 *   On exit: interrupts are detached, controller registers restored.
 *
 ****************************************************************************/

int bk7258_camera_grab(void)
{
  int ret;
  int timeout_ms;
  uint32_t frame_start;
  volatile uint8_t *buf;
  int i;

  /* Check DVP pins are configured */

  if (!g_dvp_pins_configed)
    {
      syslog(LOG_ERR,
             "[camera] DVP pins not configured - run 'camera init' first\n");
      return -ENODEV;
    }

  /* Check frame buffers allocated */

  if (!g_framebuf_allocated)
    {
      syslog(LOG_ERR,
             "[camera] Frame buffers not allocated - run 'camera buf' first\n");
      return -ENOMEM;
    }

  /* Fill target buffer with 0x5A pattern - allows detection of
   * whether DMA actually wrote data.
   */

  buf = g_camera_buf[0];
  syslog(LOG_INFO, "[camera] Filling buf[0] with 0x5A pattern (%d bytes)\n",
         CAMERA_FRAME_SIZE);

  for (i = 0; i < CAMERA_FRAME_SIZE; i++)
    {
      buf[i] = 0x5A;
    }

  /* Configure DVP controller - output to buf[0] */

  ret = dvp_ctrl_config((uint32_t)(uintptr_t)g_camera_buf[0]);
  if (ret < 0)
    {
      syslog(LOG_ERR, "[camera] DVP ctrl config failed: %d\n", ret);
      goto cleanup_ctrl;
    }

  /* Attach interrupt handler */

  ret = dvp_irq_attach();
  if (ret < 0)
    {
      syslog(LOG_ERR, "[camera] DVP IRQ attach failed: %d\n", ret);
      goto cleanup_irq;
    }

  /* Wait for one complete frame - YUV_ARRIVED interrupt.
   * Timeout 5 seconds.
   */

  frame_start = g_dvp_frame_count;
  timeout_ms  = 5000;

  syslog(LOG_INFO, "[camera] Waiting for frame (timeout %d ms)...\n",
         timeout_ms);

  while (timeout_ms > 0)
    {
      if (g_dvp_frame_count > frame_start)
        {
          break;
        }

      up_udelay(1000);  /* 1 ms */
      timeout_ms--;
    }

  if (g_dvp_frame_count <= frame_start)
    {
      syslog(LOG_ERR,
             "[camera] TIMEOUT: no frame received in 5s "
             "(VSYNC=%lu FRAME=%lu)\n",
             (unsigned long)g_dvp_vsync_count,
             (unsigned long)g_dvp_frame_count);
      ret = -ETIMEDOUT;
      goto cleanup_irq;
    }

