yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
  syslog(LOG_INFO, "[camera] Frame captured - VSYNC=%lu FRAME=%lu\n",
         (unsigned long)g_dvp_vsync_count,
         (unsigned long)g_dvp_frame_count);

  /* Hexdump first 256 bytes of captured frame.
   * Byte order: VYUY (Cr=b0 Y0=b1 Cb=b2 Y1=b3, verified with red/blue).
   * In neutral scenes: even bytes (U/V) ≈ 0x80, odd bytes (Y) vary.
   */

  syslog(LOG_INFO, "[camera] First 256 bytes of captured frame (VYUY):\n");

  for (i = 0; i < 256; i += 16)
    {
      syslog(LOG_INFO,
             "  %04X: %02X %02X %02X %02X %02X %02X %02X %02X "
             "%02X %02X %02X %02X %02X %02X %02X %02X\n",
             i,
             buf[i + 0],  buf[i + 1],  buf[i + 2],  buf[i + 3],
             buf[i + 4],  buf[i + 5],  buf[i + 6],  buf[i + 7],
             buf[i + 8],  buf[i + 9],  buf[i + 10], buf[i + 11],
             buf[i + 12], buf[i + 13], buf[i + 14], buf[i + 15]);
    }

  /* Check if buffer still contains 0x5A pattern - if so, DMA didn't write */

  {
    bool all_5a = true;
    for (i = 0; i < 256; i++)
      {
        if (buf[i] != 0x5A)
          {
            all_5a = false;
            break;
          }
      }

    if (all_5a)
      {
        syslog(LOG_ERR,
               "[camera] WARNING: buf[0] still 0x5A - DMA may not have "
               "written data\n");
        ret = -EIO;
      }
    else
      {
        syslog(LOG_INFO,
               "[camera] DMA write verified - buf[0] contains non-0x5A data\n");
        ret = 0;
      }
  }

cleanup_irq:
  dvp_irq_detach();

cleanup_ctrl:
  dvp_ctrl_deconfig();

  return ret;
}

/****************************************************************************
 * Name: bk7258_camera_stream
 *
 * Description:
 *   Phase 1 Round 3 Step 5: continuous capture with ping-pong buffering.
 *
 ****************************************************************************/

int bk7258_camera_stream(int n_frames)
{
  int ret;
  uint32_t elapsed_ms;
  int captured;
  int timeout_ms;
  int i;

  if (n_frames <= 0) n_frames = 30;
  else if (n_frames > STREAM_BUF_MAX) n_frames = STREAM_BUF_MAX;

  if (!g_dvp_pins_configed)
    {
      syslog(LOG_ERR, "[camera] DVP pins not configured\n");
      return -ENODEV;
    }

  if (!g_framebuf_allocated)
    {
      syslog(LOG_ERR, "[camera] Frame buffers not allocated\n");
      return -ENOMEM;
    }

  ret = dvp_ctrl_config((uint32_t)(uintptr_t)g_camera_buf[0]);
  if (ret < 0) goto cleanup_ctrl;

  ret = dvp_irq_attach();
  if (ret < 0) goto cleanup_irq;

  g_dvp_vsync_count = 0;
  g_dvp_frame_count = 0;
  g_pingpong_count  = 0;
  g_drop_count      = 0;
  g_cur_buf         = 0;
  g_ready_buf       = -1;
  g_busy_buf        = -1;
  g_stream_active   = true;

  syslog(LOG_INFO,
         "[camera] Stream start: capturing %d frames "
         "(buf[0]=0x%08lX buf[1]=0x%08lX)\n",
         n_frames,
         (unsigned long)(uintptr_t)g_camera_buf[0],
         (unsigned long)(uintptr_t)g_camera_buf[1]);

  captured = 0;

  while (captured < n_frames)
    {
      uint32_t frame_addr;

      timeout_ms = 5000;
      while (timeout_ms > 0)
        {
          frame_addr = dvp_frame_get();
          if (frame_addr != 0) break;
          up_udelay(1000);
          timeout_ms--;
        }

      if (frame_addr == 0)
        {
          syslog(LOG_ERR, "[camera] TIMEOUT waiting for frame %d/%d\n",
                 captured + 1, n_frames);
          ret = -ETIMEDOUT;
          break;
        }

      captured++;

      {
        const uint8_t *buf = (const uint8_t *)(uintptr_t)frame_addr;
        uint32_t y_sum = 0;
        int samples = 0;

        for (i = 0; i < CAMERA_FRAME_SIZE; i += 16 * CAMERA_HRES)
          {
            int j;
            for (j = 0; j < CAMERA_HRES; j += 16)
              {
                y_sum += buf[i + j];
                samples++;
              }
          }

        if (captured == 1 || captured == n_frames || (captured % 10) == 0)
          {
            syslog(LOG_INFO,
                   "[camera] %d/%d  VSYNC=%lu  FRAME=%lu  "
                   "Y_avg=%lu  drop=%lu\n",
                   captured, n_frames,
                   (unsigned long)g_dvp_vsync_count,
                   (unsigned long)g_dvp_frame_count,
                   (unsigned long)(samples > 0 ? y_sum / samples : 0),
                   (unsigned long)g_drop_count);
          }
      }

      dvp_frame_put();
    }

  g_stream_active = false;

  elapsed_ms = g_dvp_frame_count > 0 ? (uint32_t)g_dvp_frame_count * 33 : 0;

  syslog(LOG_INFO,
         "[camera] Stream done: captured=%d  total=%lu  drop=%lu  vsync=%lu\n",
         captured,
         (unsigned long)g_pingpong_count,
         (unsigned long)g_drop_count,
         (unsigned long)g_dvp_vsync_count);

  if (elapsed_ms > 0)
    {
      syslog(LOG_INFO, "[camera] Elapsed: ~%lu ms  Avg FPS: ~%lu\n",
             (unsigned long)elapsed_ms,
             (unsigned long)(captured * 1000 / (elapsed_ms > 0 ? elapsed_ms : 1)));
    }

  ret = captured > 0 ? 0 : -EIO;

cleanup_irq:
  dvp_irq_detach();
cleanup_ctrl:
  dvp_ctrl_deconfig();
  return ret;
}

/****************************************************************************
 * VYUY -> RGB565 scaled conversion
 *
 * GC2145 (reg 0x84 = 0x02) produces VYUY byte order in PSRAM:
 *   byte0=Cr(V), byte1=Y0, byte2=Cb(U), byte3=Y1
 *
 * Established 2026-08-21 by pointing the sensor at full-screen
 * pure red and pure blue:
 *   red  -> byte0 mean 230 (high Cr), byte2 mean 101 (low Cb)
 *   blue -> byte0 mean 127,           byte2 mean 219 (high Cb)
 * A face confirms: byte2 114 < 128 < byte0 144 (skin: Cb < Cr).
 *
 * The earlier "UYVY verified by memory dump" claim was invalid:
 * that dump was on a grey scene where Cb~Cr~128, indistinguishable.
 *
 * VYUY 4-byte layout per 2 pixels:
 *   [V   Y0  U   Y1]   i.e.   [Cr  Y0  Cb  Y1]
 *    b0  b1  b2  b3
 *
 * Pixel sx, pair pointer p = row + (sx & ~1) * 2:
 *   Y = p[1 + (sx&1)*2],  Cr = p[0],  Cb = p[2]
 ****************************************************************************/

