yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
static void uyvy_to_rgb565_scaled(const uint8_t *src,
                                  uint8_t *dst,
                                  int src_w, int src_h,
                                  int dst_w, int dst_h)
{
  int sx, sy, dx, dy;
  uint8_t *out = dst;
  int scale_x = src_w / dst_w;
  int scale_y = src_h / dst_h;

  for (dy = 0; dy < dst_h; dy++)
    {
      sy = dy * scale_y;
      const uint8_t *row = src + sy * src_w * 2;

      for (dx = 0; dx < dst_w; dx++)
        {
          uint8_t y0;
          int cb_i, cr_i, r, g, b;
          uint16_t rgb;
          int pos;

          sx = dx * scale_x;

          /* VYUY: pair pointer = start of 4-byte group */

          const uint8_t *p = row + (sx & ~1) * 2;

          y0   = p[1 + (sx & 1) * 2];     /* Y0=p[1], Y1=p[3] */
          cr_i = (int)p[0] - 128;          /* Cr (V) = byte0 */
          cb_i = (int)p[2] - 128;          /* Cb (U) = byte2 */

          r = (int)y0 + cr_i + (cr_i * 51 / 128);
          g = (int)y0 - (cb_i * 28 / 81) - (cr_i * 365 / 512);
          b = (int)y0 + cb_i + (cb_i * 99 / 128);

          if (r < 0) r = 0;
          if (r > 255) r = 255;
          if (g < 0) g = 0;
          if (g > 255) g = 255;
          if (b < 0) b = 0;
          if (b > 255) b = 255;

          /* Store as big-endian RGB565 (hi byte first) to match
           * lcd_fill_rect byte order which drives this LCD correctly.
           */

          rgb = (uint16_t)(((r >> 3) << 11) | ((g >> 2) << 5) | (b >> 3));
          pos = (dy * dst_w + dx) * 2;
          out[pos]     = (uint8_t)(rgb >> 8);    /* hi = R[4:0] G[5:3] */
          out[pos + 1] = (uint8_t)(rgb & 0xff);  /* lo = G[2:0] B[4:0] */
        }
    }
}

/****************************************************************************
 * Name: camera_bench_conversion
 *
 * Description:
 *   A/B benchmark to separate PSRAM access bottleneck from XIP flash
 *   instruction-fetch bottleneck in uyvy_to_rgb565_scaled().
 *
 *   Path A - "psram": convert directly from PSRAM source (scattered reads).
 *   Path B - "sram" : memcpy a 160x160 VYUY crop to SRAM first, then
 *            convert from there (sequential source reads).
 *
 *   Both paths output to the same destination buffer.  memcpy is timed
 *   separately and reported independently.
 *
 *   Each path runs BENCH_ROUNDS iterations; elapsed time is accumulated
 *   to overcome the 10 ms tick resolution.
 *
 ****************************************************************************/

#define BENCH_ROUNDS     50
#define BENCH_CROP_W     160
#define BENCH_CROP_H     160
#define BENCH_CROP_SIZE  (BENCH_CROP_W * BENCH_CROP_H * 2)
#define BENCH_OUT_PIXELS (BENCH_CROP_W * BENCH_CROP_H)

/* Real staging cost for Path A->SRAM: full 640x480 downscale touches
 * 160 output rows x 640x2 = 1280 bytes per source row = 204800 bytes.
 */

#define BENCH_REAL_STAGING_BYTES (BENCH_CROP_H * CAMERA_HRES * 2)

static void camera_bench_conversion(void)
{
  volatile uint8_t *psram;
  const uint8_t *psram_src;
  uint8_t *dst;
  clock_t t0;
  uint32_t elapsed_a;
  uint32_t elapsed_c;
  uint32_t elapsed_b;
  uint32_t elapsed_memcpy;
  uint32_t total_memcpy_bytes;
  uint32_t throughput_kbps;
  uint64_t ns_per_px;
  int i;

  /* SRAM staging buffer - 51200 bytes, holds one 160x160 VYUY crop */

  static uint8_t sram_stage[BENCH_CROP_SIZE];

  /* SRAM output buffer - keeps dst writes off PSRAM so ns/px reflects
   * source-side cost only.  Adds 51200 B to .bss (total ~197 KB,
   * well within the 344064-byte SRAM region).
   */

  static uint8_t sram_dst[BENCH_CROP_SIZE];

  /* Ensure a frame buffer exists in PSRAM */

  if (!g_framebuf_allocated)
    {
      printf("[bench] FAIL: no PSRAM framebuf"
             " - run camera buf first\n");
      return;
    }

  psram = g_camera_buf[0];

  /* Fill with a deterministic VYUY test pattern so the benchmark is
   * reproducible regardless of whether a real frame was captured.
   * Luminance ramps horizontally, chroma is neutral (Cb=Cr=0x80).
   */

  printf("[bench] filling PSRAM with VYUY test pattern ...\n");

  for (i = 0; i < CAMERA_FRAME_SIZE; i += 4)
    {
      uint8_t y0 = (uint8_t)((i >> 2) & 0xff);
      uint8_t y1 = (uint8_t)(((i >> 2) + 1) & 0xff);

      psram[i + 0] = 0x80;
      psram[i + 1] = y0;
      psram[i + 2] = 0x80;
      psram[i + 3] = y1;
    }

  psram_src = (const uint8_t *)g_camera_buf[0];
  dst = sram_dst;

  /* Path A: PSRAM source, 640x480 -> 160x160 (scale 4x3).
   * Memory: PSRAM (scattered reads, ~76800 accesses).
   * Pattern: non-sequential (nearest-neighbour downscale).
   */

  printf("[bench] Path A:"
         " PSRAM 640x480->160x160 (scattered) ...\n");

  t0 = clock_systime_ticks();

  for (i = 0; i < BENCH_ROUNDS; i++)
    {
      uyvy_to_rgb565_scaled(psram_src, dst,
                            CAMERA_HRES, CAMERA_VRES,
                            BENCH_CROP_W, BENCH_CROP_H);
    }

  elapsed_a = (uint32_t)TICK2MSEC(clock_systime_ticks() - t0);

  /* Path C: PSRAM source, 160x160 -> 160x160 (scale 1x1).
   * Memory: PSRAM (sequential reads - first 51200 bytes).
   * Pattern: sequential (1:1 copy, same instruction path as B).
   *
   * This isolates the access-pattern variable: A and C both read
   * from PSRAM, but A scatters while C is sequential.
   */

  printf("[bench] Path C:"
         " PSRAM 160x160->160x160 (sequential) ...\n");

  t0 = clock_systime_ticks();

  for (i = 0; i < BENCH_ROUNDS; i++)
    {
      uyvy_to_rgb565_scaled(psram_src, dst,
                            BENCH_CROP_W, BENCH_CROP_H,
                            BENCH_CROP_W, BENCH_CROP_H);
    }

  elapsed_c = (uint32_t)TICK2MSEC(clock_systime_ticks() - t0);

  /* memcpy: PSRAM -> SRAM, row-by-row 160x160 crop.
   * 160 rows x 320 bytes/row = 51200 bytes per iteration.
   * Measured to derive throughput; real staging cost extrapolated.
   */

  printf("[bench] memcpy"
         " PSRAM->SRAM (row-by-row crop) ...\n");

  t0 = clock_systime_ticks();

  for (i = 0; i < BENCH_ROUNDS; i++)
    {
      int row;
      int src_stride = CAMERA_HRES * 2;
      int crop_stride = BENCH_CROP_W * 2;

      for (row = 0; row < BENCH_CROP_H; row++)
        {
          memcpy(sram_stage + row * crop_stride,
                 psram_src + row * src_stride,
                 crop_stride);
        }
    }

  elapsed_memcpy = (uint32_t)TICK2MSEC(clock_systime_ticks() - t0);

  /* Path B: SRAM source, 160x160 -> 160x160 (scale 1x1).
   * Memory: SRAM (sequential reads).
   * Pattern: sequential (identical to Path C).
   *
   * C vs B isolates the memory-type variable: same sequential
   * pattern, but C reads PSRAM while B reads SRAM.
   */

  printf("[bench] Path B:"
         " SRAM 160x160->160x160 (sequential) ...\n");

  t0 = clock_systime_ticks();

  for (i = 0; i < BENCH_ROUNDS; i++)
    {
      uyvy_to_rgb565_scaled(sram_stage, dst,
                            BENCH_CROP_W, BENCH_CROP_H,
                            BENCH_CROP_W, BENCH_CROP_H);
    }

