yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
  elapsed_b = (uint32_t)TICK2MSEC(clock_systime_ticks() - t0);

  /* Avoid division by zero - clamp to 1 ms */

  if (elapsed_a == 0)
    {
      elapsed_a = 1;
    }

  if (elapsed_c == 0)
    {
      elapsed_c = 1;
    }

  if (elapsed_b == 0)
    {
      elapsed_b = 1;
    }

  if (elapsed_memcpy == 0)
    {
      elapsed_memcpy = 1;
    }

  printf("\n");
  printf("[bench] === camera bench:"
         " PSRAM vs SRAM, scattered vs sequential ===\n");
  printf("[bench] output pixels/iter: %d\n",
         BENCH_OUT_PIXELS);
  printf("[bench] rounds: %d\n",
         BENCH_ROUNDS);
  printf("[bench] dst: SRAM (source-side cost only)\n");
  printf("\n");

  /* Path timings with ns/px via uint64_t to avoid overflow.
   * (ms * 1000000) would overflow uint32_t at ms > 4294;
   * at 50 rounds Path A totals ~3900 ms, only 10% headroom.
   * Using uint64_t keeps the math exact and future-proof.
   */

  ns_per_px = (uint64_t)elapsed_a * 1000000ULL
              / BENCH_ROUNDS / BENCH_OUT_PIXELS;
  printf("[bench] A  PSRAM-scattered :"
         " %3lu ms total, %2lu ms/iter, %lu ns/px\n",
         (unsigned long)elapsed_a,
         (unsigned long)(elapsed_a / BENCH_ROUNDS),
         (unsigned long)ns_per_px);

  ns_per_px = (uint64_t)elapsed_c * 1000000ULL
              / BENCH_ROUNDS / BENCH_OUT_PIXELS;
  printf("[bench] C  PSRAM-sequential:"
         " %3lu ms total, %2lu ms/iter, %lu ns/px\n",
         (unsigned long)elapsed_c,
         (unsigned long)(elapsed_c / BENCH_ROUNDS),
         (unsigned long)ns_per_px);

  ns_per_px = (uint64_t)elapsed_b * 1000000ULL
              / BENCH_ROUNDS / BENCH_OUT_PIXELS;
  printf("[bench] B  SRAM -sequential:"
         " %3lu ms total, %2lu ms/iter, %lu ns/px\n",
         (unsigned long)elapsed_b,
         (unsigned long)(elapsed_b / BENCH_ROUNDS),
         (unsigned long)ns_per_px);

  printf("\n");

  /* memcpy throughput and extrapolated real staging cost.
   * Actual copy: BENCH_ROUNDS x 160 rows x 320 B = 51200 per iter.
   * Real staging (640-wide source): 160 rows x 1280 B = 204800 B.
   */

  total_memcpy_bytes =
      (uint32_t)BENCH_ROUNDS * BENCH_CROP_H * BENCH_CROP_W * 2;
  throughput_kbps = total_memcpy_bytes / elapsed_memcpy;

  printf("[bench] memcpy (160x320 crop):"
         " %lu ms total, %lu ms/iter\n",
         (unsigned long)elapsed_memcpy,
         (unsigned long)(elapsed_memcpy / BENCH_ROUNDS));
  printf("[bench] memcpy throughput     : %lu KB/s\n",
         (unsigned long)throughput_kbps);

  if (throughput_kbps > 0)
    {
      printf("[bench] real staging (204800B):"
             " ~%lu ms at measured throughput\n",
             (unsigned long)(BENCH_REAL_STAGING_BYTES
                             / throughput_kbps));
    }

  printf("\n");

  /* Attribution conclusions - percentage-based threshold.
   * At 10 ms tick resolution, a 2% difference on 50-round totals
   * (~2750 ms) is ~55 ms = 5.5 ticks, which is meaningful.
   * Anything below 2% is indistinguishable from tick jitter.
   */

  printf("[bench] --- attribution ---\n");

  if (elapsed_a > elapsed_c &&
      (elapsed_a - elapsed_c) * 100 / elapsed_c >= 2)
    {
      printf("[bench] A vs C (same PSRAM):"
             " scattered +%lu%% slower"
             " -> access pattern matters\n",
             (unsigned long)((elapsed_a - elapsed_c)
                             * 100 / elapsed_c));
    }
  else if (elapsed_c > elapsed_a &&
           (elapsed_c - elapsed_a) * 100 / elapsed_a >= 2)
    {
      printf("[bench] A vs C (same PSRAM):"
             " sequential +%lu%% slower"
             " (unexpected)\n",
             (unsigned long)((elapsed_c - elapsed_a)
                             * 100 / elapsed_a));
    }
  else
    {
      printf("[bench] A vs C (same PSRAM):"
             " <2%% delta -> no measurable"
             " access-pattern effect\n");
    }

  if (elapsed_c > elapsed_b &&
      (elapsed_c - elapsed_b) * 100 / elapsed_b >= 2)
    {
      printf("[bench] C vs B (same seq)  :"
             " PSRAM +%lu%% slower"
             " -> memory type matters\n",
             (unsigned long)((elapsed_c - elapsed_b)
                             * 100 / elapsed_b));
    }
  else if (elapsed_b > elapsed_c &&
           (elapsed_b - elapsed_c) * 100 / elapsed_c >= 2)
    {
      printf("[bench] C vs B (same seq)  :"
             " SRAM +%lu%% slower"
             " (unexpected)\n",
             (unsigned long)((elapsed_b - elapsed_c)
                             * 100 / elapsed_c));
    }
  else
    {
      printf("[bench] C vs B (same seq)  :"
             " <2%% delta -> no measurable"
             " memory-type effect\n");
    }

  printf("\n");

  /* Caveats */

  printf("[bench] NOTE: test pattern U=V=0x80 makes"
         " cb_i=cr_i=0, so\n"
         "      clamp branches never fire."
         " Absolute times are lower\n"
         "      than real camera data."
         " Relative A/B/C comparison is\n"
         "      still valid because all three paths"
         " take the same branches.\n");

#ifdef CONFIG_DEBUG_NOOPT
  printf("[bench] NOTE: compiled with"
         " CONFIG_DEBUG_NOOPT=y (-O0).\n");
#else
  printf("[bench] NOTE: compiled with"
         " CONFIG_DEBUG_FULLOPT=y, which maps to -Os (NOT -O2).\n");
#endif
}

/****************************************************************************
 * Name: bk7258_camera_bench
 *
 * Description:
 *   "camera bench" command entry point.  Delegates to
 *   camera_bench_conversion() for PSRAM-vs-SRAM access pattern timing.
 *
 ****************************************************************************/

int bk7258_camera_bench(void)
{
  camera_bench_conversion();
  return 0;
}

/****************************************************************************
 * Name: bk7258_camera_preview
 *
 * Description:
 *   Phase 1 Round 3 Step 6: capture + LCD preview.
 *
 ****************************************************************************/

int bk7258_camera_preview(int n_frames, int panel)
{
  int ret;
  int captured;
  int timeout_ms;
  int i;
  uint32_t t_start;
  uint32_t t_end;
  uint32_t now;
  uint32_t cap_ms;
  uint32_t disp_ms;
  volatile uint8_t *preview_buf;

  preview_buf = (volatile uint8_t *)PREVIEW_ADDR;

