yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
  if (n_frames <= 0) n_frames = 100;
  else if (n_frames > STREAM_BUF_MAX) n_frames = STREAM_BUF_MAX;

  if (!g_dvp_pins_configed)
    {
      syslog(LOG_ERR, "[camera] DVP pins not configured\n");
      return -ENODEV;
    }

  if (!g_framebuf_allocated)
    {
      syslog(LOG_ERR, "[camera] Frame buffers not allocated\n");
      return -ENOMEM;
    }

  ret = dvp_ctrl_config((uint32_t)(uintptr_t)g_camera_buf[0]);
  if (ret < 0) goto cleanup_ctrl;

  ret = dvp_irq_attach();
  if (ret < 0) goto cleanup_irq;

  g_dvp_vsync_count = 0;
  g_dvp_frame_count = 0;
  g_pingpong_count  = 0;
  g_drop_count      = 0;
  g_cur_buf         = 0;
  g_ready_buf       = -1;
  g_busy_buf        = -1;
  g_stream_active   = true;

  /* Initialize LCD (LDO_3V3 + backlight + SPI + GC9D01) */

  ret = bk7258_lcd_preview_init();
  if (ret < 0)
    {
      syslog(LOG_ERR, "[camera] LCD preview init failed: %d\n", ret);
      goto stop_stream;
    }

  syslog(LOG_INFO,
         "[camera] Preview start: %d frames to LCD (160x160) panel=%d\n",
         n_frames, panel);

  /* Warm-up - discard first 30 frames (sensor AE/AWB convergence) */

  for (i = 0; i < 30; i++)
    {
      uint32_t frame_addr;

      timeout_ms = 1000;
      while (timeout_ms > 0)
        {
          frame_addr = dvp_frame_get();
          if (frame_addr != 0) break;
          up_udelay(1000);
          timeout_ms--;
        }

      if (frame_addr == 0)
        {
          syslog(LOG_ERR, "[camera] TIMEOUT during warm-up frame %d\n", i);
          ret = -ETIMEDOUT;
          goto stop_stream;
        }

      dvp_frame_put();
    }

  captured = 0;
  t_start = 0;
  t_end   = 0;

  while (captured < n_frames)
    {
      uint32_t frame_addr;

      timeout_ms = 5000;
      while (timeout_ms > 0)
        {
          frame_addr = dvp_frame_get();
          if (frame_addr != 0) break;
          up_udelay(1000);
          timeout_ms--;
        }

      if (frame_addr == 0)
        {
          syslog(LOG_ERR, "[camera] TIMEOUT waiting for preview frame %d/%d\n",
                 captured + 1, n_frames);
          ret = -ETIMEDOUT;
          break;
        }

      now = g_dvp_frame_count * 33;
      if (captured == 0) t_start = now;

      uyvy_to_rgb565_scaled((const uint8_t *)(uintptr_t)frame_addr,
                            (uint8_t *)preview_buf,
                            CAMERA_HRES, CAMERA_VRES,
                            PREVIEW_W, PREVIEW_H);

      bk7258_lcd_blit_rgb565(panel, 0, 0, PREVIEW_W, PREVIEW_H,
                              (const uint8_t *)preview_buf);

      t_end = now;
      captured++;

      dvp_frame_put();

      if (captured % 10 == 0 || captured == n_frames)
        {
          cap_ms  = t_end - t_start;
          disp_ms = cap_ms > 0 ? cap_ms : 1;

          syslog(LOG_INFO,
                 "[camera] %d/%d  cap=%lu  drop=%lu  elapsed=%lums  fps=~%lu\n",
                 captured, n_frames,
                 (unsigned long)g_pingpong_count,
                 (unsigned long)g_drop_count,
                 (unsigned long)cap_ms,
                 (unsigned long)(captured * 1000 / disp_ms));
        }
    }

  ret = captured > 0 ? 0 : -EIO;

stop_stream:
  g_stream_active = false;

  cap_ms = t_end > t_start ? (t_end - t_start) : 0;

  syslog(LOG_INFO,
         "[camera] Preview done: captured=%d  total=%lu  drop=%lu  vsync=%lu\n",
         captured,
         (unsigned long)g_pingpong_count,
         (unsigned long)g_drop_count,
         (unsigned long)g_dvp_vsync_count);

  if (cap_ms > 0)
    {
      syslog(LOG_INFO,
             "[camera] Capture: ~%lu ms  Capture FPS: ~%lu  Display FPS: ~%lu\n",
             (unsigned long)cap_ms,
             (unsigned long)(captured * 1000 / cap_ms),
             (unsigned long)(captured * 1000 / cap_ms));
    }

  bk7258_lcd_preview_deinit();

cleanup_irq:
  dvp_irq_detach();
cleanup_ctrl:
  dvp_ctrl_deconfig();
  return ret;
}

/****************************************************************************
 * Name: yuv_to_rgb
 *
 * Description:
 *   Shared YUV->RGB helper for dump diagnostics.
 *   Input: Y, U, V as raw bytes (0-255).
 *   Output: r, g, b clamped to 0-255.
 *
 ****************************************************************************/

static void yuv_to_rgb(uint8_t y, uint8_t u, uint8_t v,
                        int *r, int *g, int *b)
{
  int yi = (int)y;
  int cb = (int)u - 128;
  int cr = (int)v - 128;

  *r = yi + cr + (cr * 51 / 128);
  *g = yi - (cb * 28 / 81) - (cr * 365 / 512);
  *b = yi + cb + (cb * 99 / 128);

  if (*r < 0) *r = 0;  if (*r > 255) *r = 255;
  if (*g < 0) *g = 0;  if (*g > 255) *g = 255;
  if (*b < 0) *b = 0;  if (*b > 255) *b = 255;
}

/****************************************************************************
 * Name: bk7258_camera_dump
 *
 * Description:
 *   Capture one frame, hexdump first 64 bytes, then interpret under
 *   all 4 YUV byte-orderings and print RGB for each pixel.
 *
 *   Diagnostic key: in a neutral (grey/white) scene, U and V should
 *   be near 0x80.  The format where U and V cluster around 0x80 is
 *   the correct one.
 *
 ****************************************************************************/

int bk7258_camera_dump(void)
{
  int ret;
  int timeout_ms;
  uint32_t frame_start;
  volatile uint8_t *buf;
  int i;

  if (!g_dvp_pins_configed)
    {
      syslog(LOG_ERR, "[camera] DVP pins not configured\n");
      return -ENODEV;
    }

  if (!g_framebuf_allocated)
    {
      ret = camera_framebuf_alloc();
      if (ret < 0) return ret;
    }

  /* Fill with 0xCC to detect if DMA wrote */

  buf = g_camera_buf[0];
  for (i = 0; i < 256; i++)
    ((volatile uint8_t *)buf)[i] = 0xCC;

  /* Configure DVP and capture one frame */

  ret = dvp_ctrl_config((uint32_t)(uintptr_t)g_camera_buf[0]);
  if (ret < 0) return ret;

  ret = dvp_irq_attach();
  if (ret < 0) { dvp_ctrl_deconfig(); return ret; }

  frame_start = g_dvp_frame_count;
  timeout_ms = 5000;

  while (timeout_ms > 0)
    {
      if (g_dvp_frame_count > frame_start) break;
      up_udelay(1000);
      timeout_ms--;
    }

  dvp_irq_detach();
  dvp_ctrl_deconfig();

  if (g_dvp_frame_count <= frame_start)
    {
      syslog(LOG_ERR, "[camera] dump: TIMEOUT - no frame\n");
      return -ETIMEDOUT;
    }

  /* Check if DMA wrote (not still 0xCC) */

