yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
  if (buf[0] == 0xCC && buf[1] == 0xCC && buf[2] == 0xCC)
    {
      syslog(LOG_ERR,
             "[camera] dump: buf still 0xCC - DMA did not write\n");
      return -EIO;
    }

  /* Hexdump first 64 bytes */

  syslog(LOG_INFO, "[camera] dump: first 64 bytes of captured frame:\n");
  for (i = 0; i < 64; i += 16)
    {
      syslog(LOG_INFO,
             "  %04X: %02X %02X %02X %02X %02X %02X %02X %02X "
             "%02X %02X %02X %02X %02X %02X %02X %02X\n",
             i,
             buf[i+0],  buf[i+1],  buf[i+2],  buf[i+3],
             buf[i+4],  buf[i+5],  buf[i+6],  buf[i+7],
             buf[i+8],  buf[i+9],  buf[i+10], buf[i+11],
             buf[i+12], buf[i+13], buf[i+14], buf[i+15]);
    }

  /* Interpret first 8 pixels (16 bytes) under all 4 formats */

  syslog(LOG_INFO, "[camera] dump: RGB under 4 YUV interpretations:\n");

  /* Format definitions:
   *   YUYV: [Y0  U  Y1  V ] [Y2  U  Y3  V ] ...
   *   VYUY: [V  Y0  U  Y1] [V  Y2  U  Y3] ...
   *   YYUV: [Y0 Y1  U   V ] [Y2 Y3  U   V ] ...
   *   UVYY: [U   V  Y0 Y1] [U   V  Y2 Y3] ...
   */

  for (i = 0; i < 8; i++)
    {
      int off = i * 2;
      uint8_t b0 = buf[off];
      uint8_t b1 = buf[off + 1];
      int r, g, b;
      char line[256];
      int n;

      /* For paired formats, determine which pair we're in */

      int pair_off = (i / 2) * 4;
      uint8_t pb0 = buf[pair_off];
      uint8_t pb1 = buf[pair_off + 1];
      uint8_t pb2 = buf[pair_off + 2];
      uint8_t pb3 = buf[pair_off + 3];

      n = snprintf(line, sizeof(line),
                   "  pix[%d] [%02X %02X]:", i, b0, b1);

      /* YUYV: Y=even byte, U=byte1 of pair, V=byte3 of pair */

      {
        uint8_t y = (i & 1) ? pb2 : pb0;
        uint8_t u = pb1;
        uint8_t v = pb3;
        yuv_to_rgb(y, u, v, &r, &g, &b);
        n += snprintf(line + n, sizeof(line) - n,
                      " YUYV(Y=%02X U=%02X V=%02X>R%3dG%3dB%3d)",
                      y, u, v, r, g, b);
      }

      /* VYUY: V=byte0, Y=byte1 or byte3, U=byte2 of pair (actual format) */

      {
        uint8_t v = pb0;
        uint8_t y = (i & 1) ? pb3 : pb1;
        uint8_t u = pb2;
        yuv_to_rgb(y, u, v, &r, &g, &b);
        n += snprintf(line + n, sizeof(line) - n,
                      " VYUY(Y=%02X U=%02X V=%02X>R%3dG%3dB%3d)",
                      y, u, v, r, g, b);
      }

      /* YYUV: Y0=b0, Y1=b1, U=b2, V=b3 (per pair) */

      {
        uint8_t y = (i & 1) ? pb1 : pb0;
        uint8_t u = pb2;
        uint8_t v = pb3;
        yuv_to_rgb(y, u, v, &r, &g, &b);
        n += snprintf(line + n, sizeof(line) - n,
                      " YYUV(Y=%02X U=%02X V=%02X>R%3dG%3dB%3d)",
                      y, u, v, r, g, b);
      }

      /* UVYY: U=b0, V=b1, Y0=b2, Y1=b3 (per pair) */

      {
        uint8_t u = pb0;
        uint8_t v = pb1;
        uint8_t y = (i & 1) ? pb3 : pb2;
        yuv_to_rgb(y, u, v, &r, &g, &b);
        n += snprintf(line + n, sizeof(line) - n,
                      " UVYY(Y=%02X U=%02X V=%02X>R%3dG%3dB%3d)",
                      y, u, v, r, g, b);
      }

      syslog(LOG_INFO, "%s\n", line);
    }

  syslog(LOG_INFO,
         "[camera] dump: correct format = the one where U/V ≈ 0x80\n");

  return 0;
}

/****************************************************************************
 * Name: bk7258_camera_testpat
 *
 * Description:
 *   Bypass camera - generate known RGB565 color bars and blit to LCD.
 *   If bars display correctly, blit + byte order are fine and the
 *   problem is in VYUY->RGB conversion.  If bars also look wrong, the
 *   problem is in the LCD path.
 *
 ****************************************************************************/

int bk7258_camera_testpat(void)
{
  volatile uint8_t *buf = (volatile uint8_t *)PREVIEW_ADDR;
  uint8_t *p = (uint8_t *)buf;
  int ret;
  int x, y;

  /* 8 vertical color bars, each 20px wide (20*8 = 160) */

  static const uint16_t bars[8] =
    {
      0xF800,  /* red         11111_000000_00000 */
      0x07E0,  /* green       00000_111111_00000 */
      0x001F,  /* blue        00000_000000_11111 */
      0xFFE0,  /* yellow      11111_111111_00000 */
      0x07FF,  /* cyan        00000_111111_11111 */
      0xF81F,  /* magenta     11111_000000_11111 */
      0xFFFF,  /* white       11111_111111_11111 */
      0x0000,  /* black       00000_000000_00000 */
    };

  /* Auto-init PSRAM - testpat must be runnable standalone */

  if (!g_framebuf_allocated)
    {
      ret = camera_framebuf_alloc();
      if (ret < 0)
        {
          syslog(LOG_ERR, "[camera] testpat: PSRAM init failed: %d\n", ret);
          return ret;
        }
    }

  /* Generate big-endian RGB565 in preview buffer */

  for (y = 0; y < PREVIEW_H; y++)
    {
      for (x = 0; x < PREVIEW_W; x++)
        {
          int bar = x / 20;
          uint16_t c = bars[bar];
          int pos = (y * PREVIEW_W + x) * 2;
          p[pos]     = (uint8_t)(c >> 8);
          p[pos + 1] = (uint8_t)(c & 0xff);
        }
    }

  /* Readback verify - first pixel should be red (0xF8, 0x00) */

  syslog(LOG_INFO,
         "[camera] testpat: buf[0]=0x%02X buf[1]=0x%02X "
         "(expect 0xF8 0x00 = red)\n",
         buf[0], buf[1]);

  if (buf[0] != 0xF8 || buf[1] != 0x00)
    {
      syslog(LOG_ERR,
             "[camera] testpat: PSRAM write FAILED - "
             "data did not stick (got 0x%02X 0x%02X)\n",
             buf[0], buf[1]);
      return -EIO;
    }

  /* Spot-check a few more pixels */

  {
    int pos_g  = (20 * 2) * 2;   /* x=20, first green pixel */
    int pos_b  = (40 * 2) * 2;   /* x=40, first blue pixel */
    int pos_w  = (120 * 2) * 2;  /* x=120, first white pixel */

    syslog(LOG_INFO,
           "[camera] testpat: green=0x%02X%02X blue=0x%02X%02X "
           "white=0x%02X%02X\n",
           buf[pos_g], buf[pos_g + 1],
           buf[pos_b], buf[pos_b + 1],
           buf[pos_w], buf[pos_w + 1]);
  }

  /* Initialize LCD and blit */

  ret = bk7258_lcd_preview_init();
  if (ret < 0)
    {
      syslog(LOG_ERR, "[camera] testpat: LCD init failed: %d\n", ret);
      return ret;
    }

  bk7258_lcd_blit_rgb565(0, 0, 0, PREVIEW_W, PREVIEW_H, (const uint8_t *)buf);

  syslog(LOG_INFO,
         "[camera] testpat: 8 color bars blitted to LCD (160x160)\n");
  syslog(LOG_INFO,
         "[camera] Expected: R G B Y C M W K from left to right\n");

