yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
  return 0;
}

/****************************************************************************
 * Name: bk7258_camera_uvhist
 *
 * Description:
 *   Diagnostic command: sample VYUY chrominance (U=Cb, V=Cr) and
 *   luminance (Y) from a live camera frame and print ASCII histograms.
 *
 *   Sampling grid: 640x480 VYUY, every 4th group horizontally (80 cols),
 *   every 8th row vertically (60 rows) = 4800 samples per frame.
 *   Each sample reads one 32-bit word [V Y0 U Y1] from the aligned
 *   PSRAM address - no byte-at-a-time reads.
 *   byte0 = Cr (V), byte2 = Cb (U).  See uyvy_to_rgb565_scaled().
 *
 *   Two modes:
 *     Full-range (lo<0 or lo>=hi): 16 buckets, high-nibble indexing.
 *       Backward compatible with original usage.
 *     Zoom (0<=lo<hi<=255): 32 buckets within [lo,hi].
 *       Samples outside the range are counted separately.
 *       Prints 32x32 UV grid (tight, no inter-char spaces),
 *       1D U and V histograms (32 buckets each),
 *       and peak with actual byte values (not bucket centers).
 *
 * Usage: camera uvhist [n] [lo] [hi]
 *   n   = frame count (default 1, accumulated)
 *   lo  = zoom range low  (default: full-range 16-bucket mode)
 *   hi  = zoom range high (default: full-range 16-bucket mode)
 *
 ****************************************************************************/

/* Histogram dimensions and sampling grid constants.
 * FULL_BUCKETS = 16 for legacy full-range mode.
 * ZOOM_BUCKETS = 32 for zoom mode.
 */

#define UVHIST_FULL_BUCKETS  16
#define UVHIST_ZOOM_BUCKETS  32
#define UVHIST_SAMPLES_X     80   /* every 4th VYUY group across 320 */
#define UVHIST_SAMPLES_Y     60   /* every 8th row across 480 */
#define UVHIST_TOTAL         (UVHIST_SAMPLES_X * UVHIST_SAMPLES_Y)

/* Row stride in bytes: 640 pixels * 2 bytes/pixel = 1280 */

#define UYVY_ROW_STRIDE      (CAMERA_HRES * CAMERA_BPP)

int bk7258_camera_uvhist(int n_frames, int zoom_lo, int zoom_hi)
{
  /* Largest histogram buffer needed: ZOOM_BUCKETS^2 = 1024 entries.
   * Full-range mode only uses the first FULL_BUCKETS^2 = 256 entries.
   */

  static uint32_t uv_hist[UVHIST_ZOOM_BUCKETS][UVHIST_ZOOM_BUCKETS];
  static uint32_t u_hist[UVHIST_ZOOM_BUCKETS];
  static uint32_t v_hist[UVHIST_ZOOM_BUCKETS];
  static uint32_t y_hist[UVHIST_ZOOM_BUCKETS];

  int ret;
  int captured;
  int timeout_ms;
  int row;
  int col;
  uint32_t total_samples;
  uint32_t in_range_samples;
  uint32_t u_sum;
  uint32_t v_sum;
  uint32_t y_sum;
  uint8_t u_min;
  uint8_t u_max;
  uint8_t v_min;
  uint8_t v_max;
  uint8_t y_min;
  uint8_t y_max;
  uint32_t peak_count;
  uint8_t peak_u_val;
  uint8_t peak_v_val;
  uint32_t max_hist;
  int i;
  int j;
  int nb;          /* number of buckets (16 or 32) */
  int zoom;        /* 1 if zoom mode, 0 if full-range */
  int range;       /* hi - lo in zoom mode */

  /* Density characters for ASCII histogram: 10 levels from empty to full */

  static const char density[] = " .:-=+*#%@";

  if (n_frames <= 0) n_frames = 1;

  /* Decide mode: zoom if both lo and hi are in [0,255] and lo < hi */

  zoom = (zoom_lo >= 0 && zoom_hi > zoom_lo && zoom_hi <= 255);
  nb = zoom ? UVHIST_ZOOM_BUCKETS : UVHIST_FULL_BUCKETS;
  range = zoom ? (zoom_hi - zoom_lo) : 0;

  if (!g_dvp_pins_configed)
    {
      syslog(LOG_ERR, "[uvhist] DVP pins not configured\n");
      return -ENODEV;
    }

  if (!g_framebuf_allocated)
    {
      syslog(LOG_ERR, "[uvhist] frame buffers not allocated\n");
      return -ENOMEM;
    }

  /* Zero accumulators */

  memset(uv_hist, 0, sizeof(uint32_t) * nb * nb);
  memset(u_hist, 0, sizeof(uint32_t) * nb);
  memset(v_hist, 0, sizeof(uint32_t) * nb);
  memset(y_hist, 0, sizeof(uint32_t) * nb);
  total_samples = 0;
  in_range_samples = 0;
  u_sum = 0;
  v_sum = 0;
  y_sum = 0;
  u_min = 255;
  u_max = 0;
  v_min = 255;
  v_max = 0;
  y_min = 255;
  y_max = 0;
  peak_count = 0;
  peak_u_val = 0;
  peak_v_val = 0;

  /* Start DVP streaming */

  ret = dvp_ctrl_config((uint32_t)(uintptr_t)g_camera_buf[0]);
  if (ret < 0) goto cleanup_ctrl;

  ret = dvp_irq_attach();
  if (ret < 0) goto cleanup_irq;

  g_dvp_vsync_count = 0;
  g_dvp_frame_count = 0;
  g_pingpong_count  = 0;
  g_drop_count      = 0;
  g_cur_buf         = 0;
  g_ready_buf       = -1;
  g_busy_buf        = -1;
  g_stream_active   = true;

  if (zoom)
    {
      syslog(LOG_INFO,
             "[uvhist] start: %d frame(s), %d samples/frame, "
             "zoom [%d..%d] %d buckets\n",
             n_frames, UVHIST_TOTAL, zoom_lo, zoom_hi, nb);
    }
  else
    {
      syslog(LOG_INFO,
             "[uvhist] start: %d frame(s), %d samples/frame, "
             "full-range %d buckets\n",
             n_frames, UVHIST_TOTAL, nb);
    }

  captured = 0;

  while (captured < n_frames)
    {
      uint32_t frame_addr;
      const uint8_t *buf;

      timeout_ms = 5000;
      while (timeout_ms > 0)
        {
          frame_addr = dvp_frame_get();
          if (frame_addr != 0) break;
          up_udelay(1000);
          timeout_ms--;
        }

      if (frame_addr == 0)
        {
          syslog(LOG_ERR, "[uvhist] TIMEOUT waiting for frame %d/%d\n",
                 captured + 1, n_frames);
          ret = -ETIMEDOUT;
          break;
        }

      buf = (const uint8_t *)(uintptr_t)frame_addr;
      captured++;

      /* Sample the grid: 60 rows x 80 columns.
       * Byte order is V Y0 U Y1 (see uyvy_to_rgb565_scaled).
       * byte0 = Cr (V), byte2 = Cb (U).
       * The local names u/v below keep their chroma meaning:
       * u = Cb, v = Cr.
       * Row stride = 1280 bytes, sample stride = 16 bytes (4 groups).
       */

      for (row = 0; row < CAMERA_VRES; row += 8)
        {
          const uint8_t *row_base = buf + row * UYVY_ROW_STRIDE;

          for (col = 0; col < UVHIST_SAMPLES_X; col++)
            {
              uint32_t pixel = *(const uint32_t *)(row_base + col * 16);
              uint8_t v = (uint8_t)(pixel & 0xff);         /* Cr = byte0 */
              uint8_t y = (uint8_t)((pixel >> 8) & 0xff);
              uint8_t u = (uint8_t)((pixel >> 16) & 0xff); /* Cb = byte2 */

