yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
              total_samples++;

              /* Running stats (always full range) */

              u_sum += u;
              v_sum += v;
              y_sum += y;

              if (u < u_min) u_min = u;
              if (u > u_max) u_max = u;
              if (v < v_min) v_min = v;
              if (v > v_max) v_max = v;
              if (y < y_min) y_min = y;
              if (y > y_max) y_max = y;

              /* Y histogram: always 16-bucket full-range */

              y_hist[y >> 4]++;

              if (zoom)
                {
                  /* Zoom mode: bucket into [lo,hi] range */

                  if (u >= zoom_lo && u < zoom_hi &&
                      v >= zoom_lo && v < zoom_hi)
                    {
                      int u_idx = (int)(u - zoom_lo) * nb / range;
                      int v_idx = (int)(v - zoom_lo) * nb / range;

                      if (u_idx >= nb) u_idx = nb - 1;
                      if (v_idx >= nb) v_idx = nb - 1;

                      uv_hist[v_idx][u_idx]++;
                      u_hist[u_idx]++;
                      v_hist[v_idx]++;
                      in_range_samples++;

                      /* Peak tracking with actual values */

                      if (uv_hist[v_idx][u_idx] > peak_count)
                        {
                          peak_count = uv_hist[v_idx][u_idx];
                          peak_u_val = u;
                          peak_v_val = v;
                        }
                    }
                }
              else
                {
                  /* Full-range mode: high-nibble indexing */

                  int u_idx = u >> 4;
                  int v_idx = v >> 4;

                  uv_hist[v_idx][u_idx]++;
                  u_hist[u_idx]++;
                  v_hist[v_idx]++;

                  if (uv_hist[v_idx][u_idx] > peak_count)
                    {
                      peak_count = uv_hist[v_idx][u_idx];
                      peak_u_val = u;
                      peak_v_val = v;
                    }
                }
            }
        }

      dvp_frame_put();

      if (n_frames > 1)
        {
          syslog(LOG_INFO, "[uvhist] frame %d/%d sampled\n",
                 captured, n_frames);
        }
    }

  /* Stop streaming */

  g_stream_active = false;
  dvp_irq_detach();
  dvp_ctrl_deconfig();

  if (total_samples == 0)
    {
      printf("[uvhist] no samples collected\n");
      return ret < 0 ? ret : -EIO;
    }

  /* ========== Print results ========== */

  printf("\n");

  if (zoom)
    {
      printf("[uvhist] === UV/Y histogram (%d frame(s), %lu samples, "
             "zoom [%d..%d], %d buckets) ===\n",
             n_frames, (unsigned long)total_samples,
             zoom_lo, zoom_hi, nb);
      printf("[uvhist] in-range: %lu  out-of-range: %lu\n",
             (unsigned long)in_range_samples,
             (unsigned long)(total_samples - in_range_samples));
    }
  else
    {
      printf("[uvhist] === UV/Y histogram (%d frame(s), %lu samples, "
             "full-range, %d buckets) ===\n",
             n_frames, (unsigned long)total_samples, nb);
    }

  printf("\n");

  /* Summary stats */

  printf("[uvhist] U(Cb): min=%3u  max=%3u  mean=%lu\n",
         u_min, u_max,
         (unsigned long)(u_sum / total_samples));
  printf("[uvhist] V(Cr): min=%3u  max=%3u  mean=%lu\n",
         v_min, v_max,
         (unsigned long)(v_sum / total_samples));
  printf("[uvhist] Y:     min=%3u  max=%3u  mean=%lu\n",
         y_min, y_max,
         (unsigned long)(y_sum / total_samples));

  if (peak_count > 0)
    {
      printf("[uvhist] peak UV: (U=0x%02X, V=0x%02X) count=%lu\n",
             peak_u_val, peak_v_val,
             (unsigned long)peak_count);
    }

  printf("\n");

  /* ========== 1D U histogram ========== */

  printf("[uvhist] U(Cb) histogram (%d buckets", nb);

  if (zoom)
    {
      printf(", range [%d..%d]", zoom_lo, zoom_hi);
    }

  printf(")\n");

  max_hist = 0;
  for (i = 0; i < nb; i++)
    {
      if (u_hist[i] > max_hist) max_hist = u_hist[i];
    }

  for (i = 0; i < nb; i++)
    {
      int bar_len;
      int val;

      if (zoom)
        {
          val = zoom_lo + (range * i + range / 2) / nb;
        }
      else
        {
          val = (i << 4) | 0x08;
        }

      printf("[uvhist] %3d [%5lu] ", val, (unsigned long)u_hist[i]);

      if (max_hist > 0)
        {
          bar_len = (int)((uint64_t)u_hist[i] * 40 / max_hist);
        }
      else
        {
          bar_len = 0;
        }

      for (j = 0; j < bar_len; j++)
        {
          printf("#");
        }

      printf("\n");
    }

  printf("\n");

  /* ========== 1D V histogram ========== */

  printf("[uvhist] V(Cr) histogram (%d buckets", nb);

  if (zoom)
    {
      printf(", range [%d..%d]", zoom_lo, zoom_hi);
    }

  printf(")\n");

  max_hist = 0;
  for (i = 0; i < nb; i++)
    {
      if (v_hist[i] > max_hist) max_hist = v_hist[i];
    }

  for (i = 0; i < nb; i++)
    {
      int bar_len;
      int val;

      if (zoom)
        {
          val = zoom_lo + (range * i + range / 2) / nb;
        }
      else
        {
          val = (i << 4) | 0x08;
        }

      printf("[uvhist] %3d [%5lu] ", val, (unsigned long)v_hist[i]);

      if (max_hist > 0)
        {
          bar_len = (int)((uint64_t)v_hist[i] * 40 / max_hist);
        }
      else
        {
          bar_len = 0;
        }

      for (j = 0; j < bar_len; j++)
        {
          printf("#");
        }

      printf("\n");
    }

  printf("\n");

  /* ========== 2D UV histogram (ASCII art) ========== */

  if (zoom)
    {
      /* Zoom mode: 32x32 tight grid, tick marks every 8 columns */

      printf("[uvhist] UV 32x32 grid (U=Cb horiz, V=Cr vert, "
             "range [%d..%d])\n", zoom_lo, zoom_hi);

      /* Column header with tick marks every 8 columns */

      printf("[uvhist] V\\U  ");
      for (j = 0; j < nb; j++)
        {
          if ((j & 7) == 0)
            {
              int uval = zoom_lo + (range * j + range / 2) / nb;
              printf("%-8d", uval);
            }
        }

      printf("\n");

