yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
      /* Find max for density scaling (within zoom grid) */

      max_hist = 0;
      for (i = 0; i < nb; i++)
        {
          for (j = 0; j < nb; j++)
            {
              if (uv_hist[i][j] > max_hist)
                {
                  max_hist = uv_hist[i][j];
                }
            }
        }

      /* Print rows: tight format, no spaces between chars */

      for (i = 0; i < nb; i++)
        {
          int vval = zoom_lo + (range * i + range / 2) / nb;

          printf("[uvhist] %3d ", vval);

          for (j = 0; j < nb; j++)
            {
              uint32_t count = uv_hist[i][j];

              if (count == 0)
                {
                  printf(".");
                }
              else
                {
                  int level;
                  if (max_hist == 0)
                    {
                      level = 1;
                    }
                  else
                    {
                      level = (int)((uint64_t)count * 9 / max_hist);
                      if (level < 1) level = 1;
                      if (level > 9) level = 9;
                    }

                  printf("%c", density[level]);
                }
            }

          printf("\n");
        }
    }
  else
    {
      /* Full-range mode: 16x16 spaced grid (original style) */

      printf("[uvhist] UV 16x16 grid (U=Cb horiz, V=Cr vert)\n");

      /* Column header */

      printf("[uvhist] V\\U ");
      for (j = 0; j < UVHIST_FULL_BUCKETS; j++)
        {
          printf(" %02x ", (j << 4) | 0x08);
        }

      printf("\n");

      /* Find max for density scaling */

      max_hist = 0;
      for (i = 0; i < UVHIST_FULL_BUCKETS; i++)
        {
          for (j = 0; j < UVHIST_FULL_BUCKETS; j++)
            {
              if (uv_hist[i][j] > max_hist)
                {
                  max_hist = uv_hist[i][j];
                }
            }
        }

      for (i = 0; i < UVHIST_FULL_BUCKETS; i++)
        {
          printf("[uvhist] %02X  ", (i << 4) | 0x08);

          for (j = 0; j < UVHIST_FULL_BUCKETS; j++)
            {
              uint32_t count = uv_hist[i][j];

              if (count == 0)
                {
                  printf("  . ");
                }
              else
                {
                  int level;
                  if (max_hist == 0)
                    {
                      level = 1;
                    }
                  else
                    {
                      level = (int)((uint64_t)count * 9 / max_hist);
                      if (level < 1) level = 1;
                      if (level > 9) level = 9;
                    }

                  printf("  %c ", density[level]);
                }
            }

          printf("\n");
        }
    }

  printf("\n");

  /* ========== Y histogram (ASCII bar chart, always 16 buckets) ========== */

  printf("[uvhist] Y histogram (luminance, 16 buckets)\n");
  printf("\n");

  max_hist = 0;
  for (i = 0; i < UVHIST_FULL_BUCKETS; i++)
    {
      if (y_hist[i] > max_hist)
        {
          max_hist = y_hist[i];
        }
    }

  for (i = 0; i < UVHIST_FULL_BUCKETS; i++)
    {
      int bar_len;

      printf("[uvhist] 0x%02X [%5lu] ",
             (i << 4) | 0x08,
             (unsigned long)y_hist[i]);

      if (max_hist > 0)
        {
          bar_len = (int)((uint64_t)y_hist[i] * 40 / max_hist);
        }
      else
        {
          bar_len = 0;
        }

      for (j = 0; j < bar_len; j++)
        {
          printf("#");
        }

      printf("\n");
    }

  printf("\n");

  return ret < 0 ? ret : 0;

cleanup_irq:
  dvp_irq_detach();
cleanup_ctrl:
  dvp_ctrl_deconfig();
  return ret;
}

/****************************************************************************
 * camera detect: UV chrominance direction detection
 ****************************************************************************/

/* Direction result from a single-frame skin-tone scan.
 * cx is fixed-point x10 (e.g. cx=395 means column 39.5).
 */

struct cam_dir_s
{
  int      dx;         /* -127..+127, negative = left side */
  int      cx;         /* blob centroid, column x10 */
  int      blob_l;     /* left edge of blob */
  int      blob_r;     /* right edge of blob */
  uint32_t blob_hits;  /* skin hits inside blob */
  uint32_t total_hits; /* total skin hits in frame */
  int      cr_lo;      /* adaptive Cr threshold used this frame */
  bool     valid;      /* true if blob_hits >= threshold */
};

/****************************************************************************
 * Name: camera_detect_frame
 *
 * Description:
 *   Scan one VYUY frame for skin-tone pixels, extract blob direction.
 *   Sampling grid: 80 columns x 60 rows (identical to uvhist).
 *   Triple gate: Y in [SKIN_Y_LO..SKIN_Y_HI],
 *                Cb in [SKIN_CB_LO..SKIN_CB_HI],
 *                Cr in [SKIN_CR_LO..SKIN_CR_HI].
 *   Blob extraction: peak column, half-maximum expand, weighted centroid.
 *
 *   Output written to *out.  Returns 0 always.
 *
 ****************************************************************************/

static int camera_detect_frame(const uint8_t *buf,
                               struct cam_dir_s *out)
{
  static uint16_t col_hist[DETECT_SAMPLES_X];
  static uint16_t cr_hist[256];

  int row;
  int col;
  int i;
  int bg_cr;
  int max_cr;
  int span;
  int cr_lo;
  uint16_t bg_count;
  uint32_t total_hits;
  uint32_t frame_samples;
  int peak_col;
  uint16_t peak_val;
  int blob_l;
  int blob_r;
  uint32_t blob_weighted_sum;
  uint32_t blob_hits;
  int cx;
  int dx;

  memset(col_hist, 0, sizeof(col_hist));
  memset(cr_hist, 0, sizeof(cr_hist));
  total_hits = 0;
  frame_samples = 0;

  /* Pass 1: histogram Cr over luminance-valid samples to locate the
   * background (neutral) Cr peak.  Byte order VYUY: byte0=Cr, byte1=Y0,
   * byte2=Cb.  The demo scene has no wood, so the only reddish
   * population above the neutral peak is skin.
   */

  for (row = 0; row < CAMERA_VRES; row += 8)
    {
      const uint8_t *row_base = buf + row * UYVY_ROW_STRIDE;

      for (col = 0; col < DETECT_SAMPLES_X; col++)
        {
          uint32_t pixel =
            *(const uint32_t *)(row_base + col * 16);
          uint8_t cr = (uint8_t)(pixel & 0xff);
          uint8_t y  = (uint8_t)((pixel >> 8) & 0xff);

