yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
          if (y >= SKIN_Y_LO && y <= SKIN_Y_HI)
            {
              cr_hist[cr]++;
            }
        }
    }

  /* Background Cr mode */

  bg_cr = 128;
  bg_count = 0;
  for (i = 0; i < 256; i++)
    {
      if (cr_hist[i] > bg_count)
        {
          bg_count = cr_hist[i];
          bg_cr = i;
        }
    }

  /* Robust max Cr: highest bin with real support (ignore single-pixel
   * outliers so one hot pixel cannot skew the threshold).
   */

  max_cr = bg_cr;
  for (i = 255; i > bg_cr; i--)
    {
      if (cr_hist[i] >= 3)
        {
          max_cr = i;
          break;
        }
    }

  /* Adaptive skin threshold: sit ~60% of the way from the neutral peak
   * up to the reddest real Cr.  This keeps the gate in the UPPER part of
   * the skin cluster so only the face core passes (tight blob, stable
   * centroid) instead of the whole reddish body/background.  A floor
   * margin keeps it clear of the neutral peak; clamp bounds it.  Adapts
   * to skin strength and lighting automatically.
   */

  /* Clamp max_cr: orange wires/copper reach 175+ which would push
   * cr_lo to the 156 ceiling and reject real skin (~164).  Capping
   * at SKIN_CR_CEIL keeps the adaptive threshold in skin range.
   */

  if (max_cr > SKIN_CR_CEIL) max_cr = SKIN_CR_CEIL;

  span = max_cr - bg_cr;
  cr_lo = bg_cr + (span * 6) / 10;
  if (cr_lo < bg_cr + SKIN_CR_MARGIN) cr_lo = bg_cr + SKIN_CR_MARGIN;
  if (cr_lo < SKIN_CR_LO_MIN) cr_lo = SKIN_CR_LO_MIN;
  if (cr_lo > SKIN_CR_LO_MAX) cr_lo = SKIN_CR_LO_MAX;
  out->cr_lo = cr_lo;

  /* Pass 2: per-column skin count using the adaptive threshold */

  for (row = 0; row < CAMERA_VRES; row += 8)
    {
      const uint8_t *row_base = buf + row * UYVY_ROW_STRIDE;

      for (col = 0; col < DETECT_SAMPLES_X; col++)
        {
          uint32_t pixel =
            *(const uint32_t *)(row_base + col * 16);
          uint8_t cr = (uint8_t)(pixel & 0xff);
          uint8_t y  = (uint8_t)((pixel >> 8) & 0xff);
          uint8_t cb = (uint8_t)((pixel >> 16) & 0xff);

          frame_samples++;

          if (y >= SKIN_Y_LO && y <= SKIN_Y_HI &&
              cb >= SKIN_CB_LO && cb <= SKIN_CB_HI &&
              cr >= cr_lo && cr <= SKIN_CR_HI)
            {
              col_hist[col]++;
              total_hits++;
            }
        }
    }

  /* Minimum hit check */

  if (total_hits < DETECT_MIN_HITS_PER_FRAME)
    {
      out->dx = 0;
      out->cx = (DETECT_SAMPLES_X - 1) * 5; /* center x10 */
      out->blob_l = 0;
      out->blob_r = 0;
      out->blob_hits = 0;
      out->total_hits = total_hits;
      out->valid = false;
      return 0;
    }

  /* Find peak column */

  peak_col = 0;
  peak_val = 0;
  for (i = 0; i < DETECT_SAMPLES_X; i++)
    {
      if (col_hist[i] > peak_val)
        {
          peak_val = col_hist[i];
          peak_col = i;
        }
    }

  /* Half-maximum region growing */

  blob_l = peak_col;
  blob_r = peak_col;

  while (blob_l > 0 &&
         col_hist[blob_l - 1] >= peak_val / 2)
    {
      blob_l--;
    }

  while (blob_r < DETECT_SAMPLES_X - 1 &&
         col_hist[blob_r + 1] >= peak_val / 2)
    {
      blob_r++;
    }

  /* Weighted centroid within blob */

  blob_weighted_sum = 0;
  blob_hits = 0;
  for (i = blob_l; i <= blob_r; i++)
    {
      blob_weighted_sum += (uint32_t)col_hist[i] * i;
      blob_hits += col_hist[i];
    }

  cx = blob_hits > 0
    ? (int)(blob_weighted_sum * 10 / blob_hits)
    : peak_col * 10;

  /* Normalized direction: symmetric mapping.
   * Index range 0..79, center = 39.5 = (N-1)/2.
   * dx = (cx_x10 - 395) * 127 / 395, clamped.
   */

  dx = (cx - (DETECT_SAMPLES_X - 1) * 5) * 127
       / ((DETECT_SAMPLES_X - 1) * 5);
  if (dx < -127) dx = -127;
  if (dx > 127)  dx = 127;

  out->dx = dx;
  out->cx = cx;
  out->blob_l = blob_l;
  out->blob_r = blob_r;
  out->blob_hits = blob_hits;
  out->total_hits = total_hits;
  out->valid = true;
  return 0;
}

/****************************************************************************
 * Name: bk7258_camera_detect
 *
 * Description:
 *   Multi-frame skin-tone direction detection with ASCII histogram output.
 *   Calls camera_detect_frame() per frame, accumulates col_hist for
 *   the final chart.
 *
 ****************************************************************************/

int bk7258_camera_detect(int n_frames)
{
  static uint16_t col_hist[DETECT_SAMPLES_X];

  struct cam_dir_s dir;
  int ret;
  int captured;
  int timeout_ms;
  uint32_t total_samples;
  uint32_t total_hits;
  uint32_t acc_blob_hits;
  float confidence;
  int i;

  static const char density[] = " .:-=+*#%@";

  /* Cap to prevent uint16_t col_hist overflow (60 hits/col/frame max).
   * 1092 frames * 60 = 65520 < 65535.  Use 1000 for round limit.
   */

  if (n_frames <= 0) n_frames = 1;
  if (n_frames > 1000) n_frames = 1000;

  if (!g_dvp_pins_configed)
    {
      syslog(LOG_ERR, "[detect] DVP pins not configured\n");
      return -ENODEV;
    }

  if (!g_framebuf_allocated)
    {
      syslog(LOG_ERR, "[detect] frame buffers not allocated\n");
      return -ENOMEM;
    }

  memset(col_hist, 0, sizeof(col_hist));
  total_samples = 0;
  total_hits = 0;
  acc_blob_hits = 0;

  /* Start DVP streaming */

  ret = dvp_ctrl_config((uint32_t)(uintptr_t)g_camera_buf[0]);
  if (ret < 0) goto cleanup_ctrl;

  ret = dvp_irq_attach();
  if (ret < 0) goto cleanup_irq;

  g_dvp_vsync_count = 0;
  g_dvp_frame_count = 0;
  g_pingpong_count  = 0;
  g_drop_count      = 0;
  g_cur_buf         = 0;
  g_ready_buf       = -1;
  g_busy_buf        = -1;
  g_stream_active   = true;

  syslog(LOG_INFO,
         "[detect] start: %d frame(s), %d samples/frame, "
         "adaptive Cr (bg+%d, clamp %d..%d) Y=[%d..%d] Cb=[%d..%d]\n",
         n_frames, DETECT_TOTAL,
         SKIN_CR_MARGIN, SKIN_CR_LO_MIN, SKIN_CR_LO_MAX,
         SKIN_Y_LO, SKIN_Y_HI, SKIN_CB_LO, SKIN_CB_HI);

  /* Warm-up: discard first 20 frames so AE/AWB settles before sampling.
   * A single-frame detect on a cold sensor otherwise catches a
   * mid-convergence frame (over/under-exposed, wrong white balance).
   */

  for (i = 0; i < 20; i++)
    {
      uint32_t warm_addr;

      timeout_ms = 1000;
      while (timeout_ms > 0)
        {
          warm_addr = dvp_frame_get();
          if (warm_addr != 0) break;
          up_udelay(1000);
          timeout_ms--;
        }

      if (warm_addr == 0)
        {
          syslog(LOG_ERR, "[detect] TIMEOUT warm-up frame %d\n", i);
          ret = -ETIMEDOUT;
          g_stream_active = false;
          goto cleanup_irq;
        }

      dvp_frame_put();
    }

  captured = 0;

  while (captured < n_frames)
    {
      uint32_t frame_addr;
      const uint8_t *buf;

      timeout_ms = 5000;
      while (timeout_ms > 0)
        {
          frame_addr = dvp_frame_get();
          if (frame_addr != 0) break;
          up_udelay(1000);
          timeout_ms--;
        }

      if (frame_addr == 0)
        {
          syslog(LOG_ERR,
                 "[detect] TIMEOUT frame %d/%d\n",
                 captured + 1, n_frames);
          ret = -ETIMEDOUT;
          break;
        }

