yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
      buf = (const uint8_t *)(uintptr_t)frame_addr;
      captured++;

      camera_detect_frame(buf, &dir);

      /* Accumulate col_hist from this frame's contribution.
       * camera_detect_frame() uses its own internal col_hist
       * which is zeroed each call, so we add its results
       * to our accumulated col_hist via the blob info.
       * For the ASCII chart we re-use the last frame's data.
       */

      total_samples += DETECT_TOTAL;
      total_hits += dir.total_hits;
      acc_blob_hits += dir.blob_hits;

      /* Per-frame jitter output (n>1) */

      if (n_frames > 1)
        {
          if (!dir.valid)
            {
              printf("[detect] frame %d: no target "
                     "(%lu hits < %d min)\n",
                     captured,
                     (unsigned long)dir.total_hits,
                     DETECT_MIN_HITS_PER_FRAME);
            }
          else
            {
              printf("[detect] frame %d: dx=%+d "
                     "cx=%.1f blob[%d..%d] "
                     "hits=%lu/%d\n",
                     captured, dir.dx,
                     (float)dir.cx / 10.0f,
                     dir.blob_l, dir.blob_r,
                     (unsigned long)dir.blob_hits,
                     (int)DETECT_TOTAL);
            }
        }

      dvp_frame_put();
    }

  /* Stop streaming */

  g_stream_active = false;
  dvp_irq_detach();
  dvp_ctrl_deconfig();

  /* Minimum hit check on accumulated blob hits */

  if (acc_blob_hits <
      (uint32_t)DETECT_MIN_HITS_PER_FRAME * n_frames)
    {
      printf("\n");
      printf("[detect] no target (%lu blob hits < %d min)\n",
             (unsigned long)acc_blob_hits,
             (int)(DETECT_MIN_HITS_PER_FRAME * n_frames));

      /* Separate the two failure modes.  total_hits == 0 means the
       * skin-tone gate never fired at all (sensor, exposure or gate
       * problem); a healthy total_hits with zero blob hits means the
       * blob extraction stage is at fault.  Without this line the log
       * looks identical in both cases.
       */

      printf("[detect] total_hits=%lu / %lu samples  "
             "gate Y=[%d..%d] Cb=[%d..%d] Cr=[%d..%d]\n",
             (unsigned long)total_hits,
             (unsigned long)total_samples,
             SKIN_Y_LO, SKIN_Y_HI,
             SKIN_CB_LO, SKIN_CB_HI,
             SKIN_CR_LO, SKIN_CR_HI);
      return 0;
    }

  /* Re-run last frame for ASCII chart */

  confidence = total_samples > 0
    ? (float)acc_blob_hits * 100.0f / (float)total_samples
    : 0.0f;

  printf("\n");
  printf("[detect] %d frame(s): %lu blob / %lu total / "
         "%lu samples (%.1f%%)\n",
         n_frames,
         (unsigned long)acc_blob_hits,
         (unsigned long)total_hits,
         (unsigned long)total_samples,
         confidence);

  /* Print last frame's direction result */

  printf("\n");
  printf("[detect] peak=%d  blob=[%d..%d]  width=%d  "
         "cx=%.1f  dx=%+d\n",
         dir.blob_l + (dir.blob_r - dir.blob_l) / 2,
         dir.blob_l, dir.blob_r,
         dir.blob_r - dir.blob_l + 1,
         (float)dir.cx / 10.0f,
         dir.dx);
  printf("[detect] blob_hits=%lu  total_hits=%lu\n",
         (unsigned long)dir.blob_hits,
         (unsigned long)dir.total_hits);
  printf("[detect] dx=%+d  (%s)\n",
         dir.dx,
         dir.dx < -10 ? "LEFT" :
         dir.dx > 10 ? "RIGHT" : "CENTER");

  return 0;

cleanup_irq:
  dvp_irq_detach();
cleanup_ctrl:
  dvp_ctrl_deconfig();
  return ret;
}

/****************************************************************************
 * camera track: skin-tone gaze tracking with dual-panel eye control
 ****************************************************************************/

/* EMA smoothing factor: smooth = (smooth*3 + raw) / 4 */

#define TRACK_EMA_SHIFT     2
#define TRACK_EMA_WEIGHT    7

/* Miss-to-center: after this many consecutive frames without a valid
 * target, start drifting the gaze back to center (gaze=0).
 */

#define TRACK_MISS_TO_CENTER  8

/* Maximum pupil travel in pixels.
 * Iris r=58, pupil r=22, erase r=23.
 * Beyond |28| the erase circle clips outside the iris.
 */

#define TRACK_GAZE_MAX     28

/* Full-scale |dx| for gaze mapping.
 * A face blob centroid never reaches the frame edge, so |dx| tops out
 * around 60-65 in practice (empirically raw ~ -60 for a face at column
 * 20/80).  Mapping against 127 wasted more than half the pupil travel
 * (raw -60 -> gaze -13).  Mapping against 64 lets a realistic face
 * offset drive the pupil across its full +/-TRACK_GAZE_MAX range.
 */

#define TRACK_DX_SPAN      45   /* legacy fixed span (unused now) */
#define TRACK_SPAN_MIN     30   /* floor: prevents over-amplification */

int bk7258_camera_track(int n_frames, int invert)
{
  struct cam_dir_s dir;
  int ret;
  int captured;
  int timeout_ms;
  int smooth;         /* EMA-smoothed dx, -127..+127 */
  int last_gaze;      /* last drawn gaze (for dead zone) */
  int miss_count;     /* consecutive frames without target */
  int dx_baseline;    /* slowly-tracked neutral face position */
  bool baseline_init; /* true once first valid frame sets baseline */
  int dx_span_pos;    /* adaptive rightward (positive) span */
  int dx_span_neg;    /* adaptive leftward (negative) span */
  int i;
  bool continuous;
  int stdin_flags = 0;

  continuous = (n_frames <= 0);          /* n<=0 => run until keypress */
  if (!continuous && n_frames > 1000) n_frames = 1000;

  if (!g_dvp_pins_configed)
    {
      syslog(LOG_ERR, "[track] DVP pins not configured\n");
      return -ENODEV;
    }

  if (!g_framebuf_allocated)
    {
      syslog(LOG_ERR, "[track] frame buffers not allocated\n");
      return -ENOMEM;
    }

  /* Start DVP streaming */

  ret = dvp_ctrl_config((uint32_t)(uintptr_t)g_camera_buf[0]);
  if (ret < 0) goto cleanup_ctrl;

  ret = dvp_irq_attach();
  if (ret < 0) goto cleanup_irq;

  g_dvp_vsync_count = 0;
  g_dvp_frame_count = 0;
  g_pingpong_count  = 0;
  g_drop_count      = 0;
  g_cur_buf         = 0;
  g_ready_buf       = -1;
  g_busy_buf        = -1;
  g_stream_active   = true;

  /* Initialize LCD */

  ret = bk7258_lcd_preview_init();
  if (ret < 0)
    {
      syslog(LOG_ERR, "[track] LCD init failed: %d\n", ret);
      goto stop_stream;
    }

  /* Draw both eyes centered */

  bk7258_lcd_eye_draw(0, 0);
  bk7258_lcd_eye_draw(1, 0);

  syslog(LOG_INFO,
         "[track] start: %d frames, invert=%d, "
         "Cr>=%d, gaze_max=%d\n",
         n_frames, invert, SKIN_CR_LO, TRACK_GAZE_MAX);

