yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
  /* Warm-up: discard first 20 frames (AE/AWB convergence) */

  for (i = 0; i < 20; i++)
    {
      uint32_t frame_addr;

      timeout_ms = 1000;
      while (timeout_ms > 0)
        {
          frame_addr = dvp_frame_get();
          if (frame_addr != 0) break;
          up_udelay(1000);
          timeout_ms--;
        }

      if (frame_addr == 0)
        {
          syslog(LOG_ERR,
                 "[track] TIMEOUT warm-up frame %d\n", i);
          ret = -ETIMEDOUT;
          goto stop_lcd;
        }

      dvp_frame_put();
    }

  smooth = 0;
  last_gaze = 0;
  miss_count = 0;
  dx_baseline = 0;
  baseline_init = false;
  dx_span_pos = TRACK_SPAN_MIN;
  dx_span_neg = TRACK_SPAN_MIN;
  captured = 0;

  if (continuous)
    {
      /* Non-blocking stdin so any keypress stops the loop. */

      stdin_flags = fcntl(STDIN_FILENO, F_GETFL, 0);
      fcntl(STDIN_FILENO, F_SETFL, stdin_flags | O_NONBLOCK);
      syslog(LOG_INFO,
             "[track] continuous mode - press Enter to stop\n");
    }

  while (continuous || captured < n_frames)
    {
      uint32_t frame_addr;
      int raw_dx;
      int new_gaze;

      if (continuous)
        {
          char ch;
          if (read(STDIN_FILENO, &ch, 1) > 0)
            {
              break;
            }
        }

      timeout_ms = 5000;
      while (timeout_ms > 0)
        {
          frame_addr = dvp_frame_get();
          if (frame_addr != 0) break;
          up_udelay(1000);
          timeout_ms--;
        }

      if (frame_addr == 0)
        {
          syslog(LOG_ERR,
                 "[track] TIMEOUT frame %d/%d\n",
                 captured + 1, n_frames);
          ret = -ETIMEDOUT;
          break;
        }

      camera_detect_frame(
        (const uint8_t *)(uintptr_t)frame_addr, &dir);
      dvp_frame_put();
      captured++;

      if (!dir.valid)
        {
          miss_count++;

          if (miss_count >= TRACK_MISS_TO_CENTER)
            {
              /* Drift toward center */

              raw_dx = 0;
            }
          else
            {
              /* Hold last direction */

              raw_dx = smooth;
            }
        }
      else
        {
          int d = invert ? -dir.dx : dir.dx;

          miss_count = 0;

          /* First valid frame initialises baseline so the
           * very first gaze starts centred.
           */

          if (!baseline_init)
            {
              dx_baseline = d;
              baseline_init = true;
            }

          /* Slowly track the neutral face position (~seconds
           * time constant) to compensate for camera framing.
           * Only updated on valid frames so the baseline does
           * not drift when no face is present.
           */

          dx_baseline = (dx_baseline * 31 + d) / 32;

          /* Offset from baseline is the gaze signal; this
           * makes left/right symmetric around the user's
           * natural resting position.
           */

          raw_dx = d - dx_baseline;
        }

      /* EMA smoothing: smooth = (smooth*3 + raw) / 4
       *
       * Division, not an arithmetic shift.  ">>" rounds toward negative
       * infinity, so on the negative side the filter sticks: with
       * smooth=-1, raw=0 the shift gives (-3)>>2 == -1 forever, while
       * /4 gives 0 and lets the value settle back to center.
       * Truncating division is symmetric about zero.
       */

      smooth = (smooth * TRACK_EMA_WEIGHT + raw_dx)
               / (TRACK_EMA_WEIGHT + 1);

      /* Per-side auto-range: each direction is normalised by its own
       * tracked peak, so both sides reach full pupil travel even if the
       * camera framing makes one side read larger.  Expand to new peaks
       * instantly, decay slowly toward the floor.
       */

      if (smooth >= 0)
        {
          if (smooth > dx_span_pos)
            {
              dx_span_pos = smooth;
            }
          else
            {
              dx_span_pos = (dx_span_pos * 63 +
                             TRACK_SPAN_MIN) / 64;
            }

          new_gaze = smooth * TRACK_GAZE_MAX / dx_span_pos;
        }
      else
        {
          int m = -smooth;

          if (m > dx_span_neg)
            {
              dx_span_neg = m;
            }
          else
            {
              dx_span_neg = (dx_span_neg * 63 +
                             TRACK_SPAN_MIN) / 64;
            }

          new_gaze = smooth * TRACK_GAZE_MAX / dx_span_neg;
        }

      /* Clamp */

      if (new_gaze < -TRACK_GAZE_MAX)
        {
          new_gaze = -TRACK_GAZE_MAX;
        }

      if (new_gaze > TRACK_GAZE_MAX)
        {
          new_gaze = TRACK_GAZE_MAX;
        }

      /* Dead zone: skip redraw if movement < 2 pixels */

      if (new_gaze != last_gaze &&
          abs(new_gaze - last_gaze) >= 3)
        {
          up_disable_irq(BK7258_IRQ_YUV_BUF);
          bk7258_lcd_eye_gaze(0, last_gaze, new_gaze);
          bk7258_lcd_eye_gaze(1, last_gaze, new_gaze);
          up_enable_irq(BK7258_IRQ_YUV_BUF);
          last_gaze = new_gaze;
        }

      /* Periodic status line */

      if (captured % 10 == 0 || (!continuous && captured == n_frames))
        {
          /* raw_dx is the post-invert value actually fed to the EMA;
           * printing dir.dx would hide the effect of invert.  total is
           * printed next to blob so a MISS can be attributed to either
           * the skin-tone gate or the blob extraction stage.
           */

          char dstr[12];
          if (continuous) snprintf(dstr, sizeof(dstr), "cont");
          else snprintf(dstr, sizeof(dstr), "%d", n_frames);

          printf("[track] %d/%s  raw=%+d  smooth=%+d "
                 "gaze=%+d  blob=%lu  total=%lu  cr>=%d  %s\n",
                 captured, dstr,
                 raw_dx,
                 smooth, new_gaze,
                 (unsigned long)dir.blob_hits,
                 (unsigned long)dir.total_hits,
                 dir.cr_lo,
                 dir.valid ? "OK" : "MISS");
        }
    }

  if (continuous)
    {
      fcntl(STDIN_FILENO, F_SETFL, stdin_flags);
    }

  /* Return eyes to center */

  if (last_gaze != 0)
    {
      up_disable_irq(BK7258_IRQ_YUV_BUF);
      bk7258_lcd_eye_gaze(0, last_gaze, 0);
      bk7258_lcd_eye_gaze(1, last_gaze, 0);
      up_enable_irq(BK7258_IRQ_YUV_BUF);
    }

  ret = captured > 0 ? 0 : -EIO;

