yz471686525-eng/contest2026_098_zhanshangxingguang/board/contest_board/src/bk7258_camera.c
stop_lcd:
  bk7258_lcd_preview_deinit();

stop_stream:
  g_stream_active = false;
  dvp_irq_detach();
  dvp_ctrl_deconfig();

  syslog(LOG_INFO,
         "[track] done: captured=%d  "
         "pingpong=%lu  drop=%lu\n",
         captured,
         (unsigned long)g_pingpong_count,
         (unsigned long)g_drop_count);

  return ret;

cleanup_irq:
  dvp_irq_detach();
cleanup_ctrl:
  dvp_ctrl_deconfig();
  return ret;
}

/****************************************************************************
 * DEBUG_JOURNAL - GC2145/DVP Hardware Notes
 ****************************************************************************
 *
 * Companion to the DEBUG_JOURNAL block in bk7258_gc9d01.c (SPI/LCD side)
 * and to board/contest_board/DEBUG_JOURNAL_zh-cn.md section 24.
 *
 * ========================================================================
 * Confirmed Hardware Facts
 * ========================================================================
 *
 * SCCB (sensor control bus):
 *   Bit-banged, open-drain.  GC2145 7-bit address 0x3C.
 *   Chip ID: reg 0xF0 = 0x21, reg 0xF1 = 0x45.
 *   "Drive low" = output_enable(bit3)=0 + output_value(bit1)=0 +
 *   second_func(bit6)=0.  "Release" = output_enable=1 (disabled) +
 *   input_enable(bit2)=1.  Never drive high: the bus has an external
 *   pull-up and driving high fights other devices.
 *
 * MCLK:
 *   Must be on P27 with function select = 1.  No other pin works; the
 *   clock output is hard-wired to that pad function.
 *   Source select and divider live in the 0x44010000 SYS register block.
 *
 * DVP data bus:
 *   P29-P39 (11 pins: PCLK, HSYNC, VSYNC, PXDATA0-7), function select 0.
 *   CFG per pin: output disabled, input disabled, pull disabled,
 *   second_func = 1.  Note function select 0 and second_func 1 are two
 *   different fields in two different registers; both are required.
 *
 * Interrupt path:
 *   The DVP (YUV_BUF/CIS) interrupt does NOT reach the NVIC directly.
 *   BK7258 has a SYS-level interrupt aggregator in front of the NVIC:
 *   cpu1_int_32_63_en at 0x4401008C must be enabled as well.  This is
 *   the same class of trap as the UART RX issue in section 18.27 of the
 *   markdown journal - two gates in series, enabling only the NVIC one
 *   leaves the interrupt permanently silent.
 *
 * Module clock gate:
 *   sys_reserver_reg0xd at 0x44010034, bit[9] = cis_auxs_cken.
 *
 * Frame buffers:
 *   640x480, 2 bytes/pixel = 614400 bytes per frame, two buffers in
 *   PSRAM at 0x60000000.  DVP DMA needs 32/64-byte alignment, which
 *   plain mm_malloc cannot guarantee - this is why bk7258_psram_memalign()
 *   was added during the PSRAM S4 stage (see markdown section 22.12).
 *   Preview scratch buffer at 0x6012C000, 160x160x2 = 51200 bytes.
 *
 * ========================================================================
 * Pixel Format: VYUY, not UYVY
 * ========================================================================
 *
 * GC2145 register 0x84 = 0x02.  The actual PSRAM byte order is
 * V Y0 U Y1, i.e. byte0 = Cr(V), byte1 = Y0, byte2 = Cb(U), byte3 = Y1.
 *
 * History:
 *   1. ARMino's dvp_gc2145.c labels reg 0x84=0x02 as "yuyv".
 *   2. First verification (memory dump on grey scene) concluded "UYVY"
 *      because byte0 and byte2 were both ~0x80 and indistinguishable.
 *   3. Second verification (pure-red / pure-blue color targets, 2026-08-21)
 *      proved byte0 = Cr, byte2 = Cb, i.e. VYUY.
 *
 * Lesson: a memory dump can show WHICH bytes carry chroma, but on a
 * symmetric scene (grey, where Cb~Cr~128) it cannot distinguish the
 * two.  Order requires a scene that breaks symmetry — pure red or
 * pure blue — so the two chroma channels have different values.
 *
 * Getting this backwards does not produce garbage — it produces a
 * plausible-looking but wrongly-tinted image (skin turns green/purple).
 *
 * Identifier naming in this file still says YUYV/UYVY in places because
 * it tracks the ARMino register table it was ported from.
 *
 * ========================================================================
 * Ping-Pong Buffer Ownership
 * ========================================================================
 *
 * Three-state ownership avoids the DVP-vs-consumer race:
 *
 *   g_cur_buf    the buffer DVP is currently writing into
 *   g_ready_buf  a complete frame waiting to be consumed (-1 = none)
 *   g_busy_buf   the buffer a consumer is currently reading (-1 = none)
 *
 * On YUV_ARV (frame complete) in ISR context:
 *   advance only if g_ready_buf < 0 AND next_buf != g_busy_buf.
 *   Otherwise increment g_drop_count and keep writing the same buffer.
 *
 * The point is that the ISR never hands DVP a buffer someone else is
 * reading, and never overwrites an undelivered frame.  Dropping a frame
 * is always preferable to tearing one.  The DVP write address register
 * (YUV_BUF_REG_0x08) is reprogrammed inside the ISR, so the handoff is
 * atomic with respect to the consumer.
 *
 * Before this change the consumer read whichever buffer DVP happened to
 * be filling, producing intermittent horizontal tearing that looked like
 * an SPI timing problem.  Worth remembering: a display artefact is not
 * necessarily a display bug.
 *
 * ========================================================================
 * Preview Performance (about 7 fps)
 * ========================================================================
 *
 * camera preview 30 left: about 127.6 ms/frame at -O0
 *   blit                about 50 ms   SPI transfer at 13MHz/burst 32
 *   downsample+convert  about 78 ms   dominant cost
 *
 * SUPERSEDED 2026-08-20.  This block previously attributed the 78 ms to
 * the PSRAM access pattern (76800 scattered reads behind QSPI).  That was
 * never isolated, and "camera bench" disproved it.  Original text kept in
 * DEBUG_JOURNAL_zh-cn.md section 24.5 as a record of the mistake.
 *
 * What the measurement actually shows (see camera_bench_conversion(),
 * and DEBUG_JOURNAL_zh-cn.md section 25 for the full write-up):
 *
 *   Three paths, identical output pixel count and identical instruction
 *   path, differing only in where the source lives and how it is walked:
 *     A  PSRAM, scattered (4:1/3:1 downscale, 204800 B touched)
 *     C  PSRAM, sequential (1:1, 51200 B touched)
 *     B  SRAM,  sequential (1:1, 51200 B touched)
 *
 *              -O0                    -Os
 *     A   55 ms  2156 ns/px     13 ms   523 ns/px
 *     C   54 ms  2132 ns/px     13 ms   507 ns/px
 *     B   54 ms  2132 ns/px     12 ms   500 ns/px
 *
 *   A vs C isolates access pattern: 1% (-O0) / 3% (-Os).
 *   C vs B isolates memory type:    no measurable difference.
 *
 * So PSRAM is not the bottleneck and neither is the access pattern.  The
 * real cause is -O0 code size: the inner loop is 177 instructions per
 * output pixel, 66 of them (37%) stack accesses.  At -Os it drops to 43
 * instructions and 3 stack accesses, and the whole loop gets 4.2x faster.
 *
 * Measured CPI is 1.45 (-O0) / 1.40 (-Os).  For a core with no cache
 * executing XIP from QSPI flash that implies an effective prefetch
 * buffer, i.e. instruction fetch is not stalling either.  Moving the hot
 * loop into the 16 KB ITCM therefore has limited upside.
 *
 * Consequences for the two optimisations this block used to recommend:
 *   a) SRAM staging: DEAD.  Real staging must move 204800 B (the
 *      downscale touches 160 rows x 1280 B), costing 44 ms (-O0) /
 *      12 ms (-Os) at the measured memcpy throughput, to recover the
 *      1-3% that access pattern is worth, i.e. about 0.4 ms.
 *   b) DVP hardware crop: still useful, but the reason was wrong.  It
 *      helps by reducing the pixel count, not by removing scatter.
 *
 * Deliberately NOT optimised further.  Full-screen preview is a bring-up
 * and demo path, not the production one.  Production is: capture to
 * PSRAM, run detection there, emit a direction, redraw only the eyes.
 *
 * Input to the next work item (face detection): the budget is 500 ns per
 * pixel = 60 cycles = 43 instructions for a full YUV->RGB565 convert.
 * Selection criterion is INSTRUCTIONS PER PIXEL, not memory access
 * pattern -- the opposite of what this block used to say.  Algorithms
 * with irregular access (Haar/LBP cascades walking an integral image)
 * are not penalised.  Direction finding needs no RGB at all: two
 * threshold compares on U and V is roughly 10 instructions per pixel,
 * about 3 ms for a full 160x160 pass, under 1 ms with 1/4 subsampling.
 *
 * Methodology lesson: do not attribute performance on an unoptimised
 * build, and make A/B experiments change exactly one variable.  The
 * first version of this benchmark had only paths A and B, which varied
 * memory type and access pattern together and could not attribute
 * anything.
 *
 * ========================================================================
 * Gotchas
 * ========================================================================
 *
 * a) 0x44010028 and 0x44010030 are SHARED between LCD and DVP clock
 *    configuration.  Always read-modify-write.  A blank overwrite
 *    silently corrupts the other subsystem's clock and the failure
 *    surfaces far away from the write.
 *
 * b) Save and restore the full 4-bit function field plus the pin CFG
 *    when taking over or releasing pins (gpio_state_t, mclk_state_t).
 *    Restoring a guessed default instead of the saved value breaks
 *    whatever owned the pin before.
 *
 * c) SDA and SCL must be distinct pins.  The code asserts this because
 *    a misconfigured Kconfig produced a silent "SDA=SCL" bus that
 *    ACKed nothing and looked like a dead sensor.
 *
 * d) Board-level reserved pins are checked before claiming DVP pins,
 *    because P29 was previously the left LCD reset line.  Pin
 *    reassignment between subsystems is the most common source of
 *    "it worked yesterday" regressions on this board.
 *
 ****************************************************************************/
